package org.example;

import org.telegram.telegrambots.meta.api.methods.send.SendMessage;
import org.telegram.telegrambots.meta.api.methods.send.SendPhoto;
import org.telegram.telegrambots.meta.api.objects.InputFile;
import org.telegram.telegrambots.meta.api.objects.replykeyboard.InlineKeyboardMarkup;
import org.telegram.telegrambots.meta.api.objects.replykeyboard.ReplyKeyboardMarkup;
import org.telegram.telegrambots.meta.api.objects.replykeyboard.buttons.InlineKeyboardButton;
import org.telegram.telegrambots.meta.api.objects.replykeyboard.buttons.KeyboardButton;
import org.telegram.telegrambots.meta.api.objects.replykeyboard.buttons.KeyboardRow;

import java.util.ArrayList;
import java.util.List;

public class MyBotServiceRu {
    String[] cities = {"Ташкент", "Андижан", "Наманган", "Фергана", "Бухара", "Карши", "Чирчик", "Термез", "Кибрай", "Ургенч", "Навои", "Нукус", "Бекабад", "Джизак", "Шымкент (Казахстан)", "Алматы (Казахстан)"};

    String[] onetotwo = {"Сафия Нукус", "Авайхон", "Автобазар", "Оккурган", "Алгоритм", "Алмалык", "Аль-Хоразмий", "Ангрен", "Андалус (Шухрат)", "Андижан Навруз"};
    String[] twotothree = {"Андижан Узбегим", "Ардуз", "Атлас", "Ахмад", "Ашрафий", "Аэропорт", "Бекабад", "Белтепа", "Бешкайрагач", "Бобур-МКАД"};
    String[] threetofour = {"Ботника", "Бошка", "Бульвар", "Бунёдкор", "Сафия Бухара", "Ватан", "Вега", "Сафия Сувсоз", "Гагарин", "Газалкент"};
    String[] fourtofive = {"Ганга", "Гейдар Алиев", "Глинка", "Глобус", "Грандмир", "Гулобод", "Сафия Дархон", "Думбирабад", "Камолон", "Дружба мандарин"};
    String[] fivetosix = {"Дьюти Фри", "Джомий", "Бекабад", "Зенит", "Зиёлилар", "Ибн Сино", "Иза", "Кадишево", "Карасарой", "Карши Келес"};
    String[] sixtoseven = {"Кибрай", "Коканд", "Коммунизм", "Компас", "Кондитерская фабрика", "Корасув", "Крестик", "Кукча", "Кургонтепа", "Кушбеги"};
    String[] seventoeight = {"Лабзак", "Лакокраска", "Луначарский", "Максим Горький", "Малика", "Мевазор", "Мега Планет", "Медгородок", "Мехржон", "Минор"};
    String[] eighttonine = {"Навои", "Назарбек", "Наманган Галаба", "Сафия Наманган", "Некстр", "Новза", "Нурафшон", "Океан", "Паркент", "Парус"};
    String[] ninetoten = {"Пионерский", "Ракат", "Рисовый", "Сайрам", "Сампи", "Саракулка", "Себзор", "Северный вокзал", "Сергели", "Сеул Мун"};
    String[] tentoeleven = {"Сити Мол", "Спутник", "Тансикбоев", "ТошМИ", "Телебашня", "Термез", "Тинчлик", "ТТЗ", "Туйтепа", "Турин"};
    String[] eleventotwelve = {"Узбум", "Домашний рынок", "Ургенч", "Урикзор", "Три богатыря", "Файзобод", "Фархадский", "Фергана", "Феруза", "Хайтаун"};
    String[] twelvetothirteen = {"Хаст-Имам", "Хувайдо", "С1 (Содик Азимов)", "МУМ", "Чигатай", "Чиназ", "Чирчик", "Чорсу", "Шахристон", "Шота Руставели"};
    String[] thirteentofourteen = {"Шохимардон", "Шохсарой", "ШТАБ", "Эко Бозор", "Эркин", "Эшонгузар", "Янги Куйлюк", "Янги Юнусобод", "Янгибозор", "Янги Хаёт", "Янгийул"};

    String[] mazali = {"Круглые торты", "Прямоугольные торты", "Мини-торты", "Большие пироги", "Круглые пироги", "Пирожные", "Рулеты", "Эклеры", "Макаронс", "Готовые блюда", "Сладости", "Печенье", "Упакованные эклеры", "Сладкая выпечка", "Кексы", "Тарталетки", "Слоёная выпечка", "Сытная выпечка", "Имбирный пряник", "⬅️ В главное меню"};

    String[] yumaloqtort = {"Мини торт Вишенка", "Торт Адмирал", "Торт Барби", "Торт Баунти", "Торт Верона", "Торт Виктория", "Торт Джульетта", "Торт Джульетта украшенный", "Торт Динозаврик", "Торт Ириска", "Торт Карамельно-медовик", "Торт Киевский", "Торт Киевский украшенный", "Торт Киевский розовый", "Торт Киевский с рожком", "Торт Корзинка", "Торт Микс", "Торт «Молочная девочка»", "Торт Мороженко", "Торт Орео", "Торт «Песочно-малиновый»", "Торт Прага", "Торт «Птичье молоко»", "Торт Радуга шоколадный", "Торт Рафаэлло", "Торт Роше", "Торт «Сафия бежевый»", "Торт Сафия украшенный", "Торт Сафия розовый", "Торт Сникерс", "Торт Фруктовый", "Торт Черный принц", "Торт Шоколад-банан", "Торт Шоколад-малина", "Торт Ягодно-творожный", "⬅️ Назад"};
    String[] yumaloqtortphoto = {"https://t.me/safiapictures/14", "https://t.me/safiapictures/15", "https://t.me/safiapictures/16", "https://t.me/safiapictures/17", "https://t.me/safiapictures/18", "https://t.me/safiapictures/19", "https://t.me/safiapictures/20", "https://t.me/safiapictures/21", "https://t.me/safiapictures/22", "https://t.me/safiapictures/23", "https://t.me/safiapictures/24", "https://t.me/safiapictures/25", "https://t.me/safiapictures/26", "https://t.me/safiapictures/27", "https://t.me/safiapictures/28", "https://t.me/safiapictures/29", "https://t.me/safiapictures/32", "https://t.me/safiapictures/33", "https://t.me/safiapictures/34", "https://t.me/safiapictures/35", "https://t.me/safiapictures/36", "https://t.me/safiapictures/37", "https://t.me/safiapictures/38", "https://t.me/safiapictures/39", "https://t.me/safiapictures/40", "https://t.me/safiapictures/41", "https://t.me/safiapictures/42", "https://t.me/safiapictures/44", "https://t.me/safiapictures/45", "https://t.me/safiapictures/46", "https://t.me/safiapictures/47", "https://t.me/safiapictures/48", "https://t.me/safiapictures/49", "https://t.me/safiapictures/50", "https://t.me/safiapictures/51"};
    String[] yumaloqtortcaption = {"Мини торт Вишенка\n\nКлассический ганаш и свежая вишня с песочным коржом. Рассчитан на 6–8 человек. Перед употреблением рекомендуется разморозить торт в течение 2 часов.", "Торт Адмирал\n\n4 вида бисквита: ванильный, ореховый, маковый и шоколадный. Сочетание шоколадного, ванильного крема и ирисового крема с хрустящей шоколадной начинкой с пастой из фундука и вишни. Перед употреблением рекомендуется разморозить торт в течение 2 часов.", "Торт Барби\n\nБелый бисквит с ягодами, нежный йогуртовый крем, крем «Пломбир» и клубнично-малиновый крем. Перед употреблением рекомендуется разморозить торт в течение 2 часов.", "Торт Баунти\n\nНежный кокосовый крем и кокосовая начинка Баунти со впитанным шоколадом в шоколадном бисквите. Рассчитан на 6–8 человек. Перед употреблением рекомендуется разморозить торт в течение 2 часов.", "Апельсиновый курд и ягодный\n\nБелый бисквит с кремами: вишнёвым, банановым, малиновым и яблочным. Перед употреблением рекомендуется разморозить торт в течение 2 часов.", "Торт Виктория\n\nШоколадный бисквит, пропитанный шоколадным сиропом, в сочетании с шоколадным кремом на основе сгущённого молока, масла и какао. Перед употреблением рекомендуется разморозить торт в течение 2 часов.", "Торт Джульетта\n\nБелый бисквит с ягодами, нежный йогуртовый крем, крем «Пломбир» и клубнично-малиновый крем. Рассчитан на 8–10 человек. Перед употреблением рекомендуется разморозить торт в течение 2 часов."};
    String[] yumaloqtortnarx = {"115 000", "299 000", "299 000", "259 000", "219 000", "269 000", "249 000", "259 000", "299 000", "319 000", "259 000", "329 000", "349 000", "319 000", "289 000", "309 000", "259 000", "249 000", "299 000", "375 000", "185 000", "219 000", "165 000", "315 000", "239 000", "409 000", "369 000", "299 000", "359 000", "299 000", "299 000", "269 000", "285 000", "345 000", "299 000", "249 000"};

    String[] togriburchakli = {"Афганский прямоугольный торт", "Дарий прямоугольный торт", "Итальяно прямоугольный торт", "Карамельный Медовик прямоугольный торт", "Лимонный прямоугольный торт", "Малинка прямоугольный торт", "Маркиза прямоугольный торт", "Меренговый прямоугольный торт", "Микадо прямоугольный торт", "Милано прямоугольный торт", "Наполеон прямоугольный торт", "Ореховый Медовик прямоугольный торт", "Саксония прямоугольный торт", "Сникерс прямоугольный торт", "Творожно-бисквитный торт", "Фруктовый жёлтый торт", "Фруктовый розовый торт", "Чёрный принц торт", "Шоколад-банан торт", "Шоколад-малина торт", "Шоколадный медовик торт", "Ягодный Малинка торт", "Якобс торт", "⬅️ Назад"};
    String[] togriburchakliphoto = {"https://t.me/safiapictures/52", "https://t.me/safiapictures/53", "https://t.me/safiapictures/54", "https://t.me/safiapictures/55", "https://t.me/safiapictures/56", "https://t.me/safiapictures/57", "https://t.me/safiapictures/59", "https://t.me/safiapictures/60", "https://t.me/safiapictures/61", "https://t.me/safiapictures/62", "https://t.me/safiapictures/63", "https://t.me/safiapictures/65", "https://t.me/safiapictures/66", "https://t.me/safiapictures/67", "https://t.me/safiapictures/69", "https://t.me/safiapictures/70", "https://t.me/safiapictures/71", "https://t.me/safiapictures/72", "https://t.me/safiapictures/73", "https://t.me/safiapictures/74", "https://t.me/safiapictures/75", "https://t.me/safiapictures/76", "https://t.me/safiapictures/77"};
    String[] togriburchaklicaption = {"Прямоугольный торт Афганский\n\nХрустящий корж, меренга, орехи и сливочный крем с варёной сгущёнкой. Рассчитан на 24 порции. Перед употреблением рекомендуется разморозить 2 часа.", "Прямоугольный торт Дарий\n\nТонкие белые бисквитные коржи с творожно-сливочным кремом и малиновым конфитюром. Рассчитан на 24 порции. Разморозить 2 часа.", "Прямоугольный торт Итальяно\n\nОреховый бисквит с кремом из ириски и сгущённого молока. Рассчитан на 16 порций. Разморозить 2 часа.", "Прямоугольный торт Карамельный Медовик\n\nМягкие медовые коржи со сливочным кремом и нежной карамелью. Рассчитан на 24 порции. Разморозить 2 часа.", "Прямоугольный торт Лимонный\n\nПесочное тесто с безе и сливочным кремом с лимонной начинкой и сгущённым молоком. Разморозить 2 часа.", "Прямоугольный торт Малинка\n\nБелый бисквит с малиново-сливочным и бананово-сливочным кремом. Рассчитан на 24 порции. Разморозить 2 часа.", "Прямоугольный торт Маркиза\n\nХрустящие коржи, меренга, орехи и крем с варёной сгущёнкой. Разморозить 2 часа.", "Прямоугольный торт Меренговый\n\nБелый бисквит с ганашем из белого шоколада, малиновым сиропом и апельсиновым курдом. Разморозить 2 часа.", "Прямоугольный торт Микадо\n\nШоколадно-медовый торт с кремом из варёной сгущёнки и взбитых сливок. Разморозить 2 часа.", "Прямоугольный торт Милано\n\nШоколадно-ореховый бисквит с шоколадно-сливочным кремом и шоколадной начинкой. 16 порций. Разморозить 2 часа.", "Прямоугольный торт Наполеон\n\nСлоёное песочное тесто со сливочным кремом и сгущёнкой. 24 порции. Разморозить 2 часа.", "Прямоугольный торт Ореховый Медовик\n\nМедовые коржи с орехами и сливочным кремом. 24 порции. Разморозить 2 часа.", "Прямоугольный торт Саксония\n\nШоколадный бисквит с шоколадно-сливочным кремом и вишнёвой начинкой. 24 порции.", "Прямоугольный торт Сникерс\n\nШоколадный бисквит с карамельно-арахисовой и ирисочной начинкой. Разморозить 2 часа.", "Творожно-бисквитный торт\n\nБелый бисквит, пропитанный сиропом, со сливочно-творожным кремом. 24 порции.", "Прямоугольный торт Фруктовый жёлтый\n\nТонкие масляные коржи с кремом и апельсиново-малиновым конфитюром. 24 порции.", "Прямоугольный торт Фруктовый розовый\n\nТонкие коржи «Салма», бананово-сливочный и вишнёво-сливочный крем. 24 порции.", "Прямоугольный торт Чёрный принц\n\nШоколадные коржи, шоколадно-сливочный крем и вишнёвая начинка. 16 порций.", "Прямоугольный торт Шоколад-банан\n\nШоколадный бисквит с банановой и трюфельной начинкой. 16 порций.", "Прямоугольный торт Шоколад-малина\n\nХрустящие медовые коржи, сливочный крем и свежая малина. 24 порции.", "Прямоугольный торт Шоколадный медовик\n\nТонкие шоколадно-медовые коржи со сметанно-сливочным кремом.", "Прямоугольный торт Ягодный Малинка\n\nБелый бисквит, пропитанный сиропом, крем-мусс и малина. Украшен сливками и маршмеллоу.", "Прямоугольный торт Якобс\n\nКофейный бисквит с кофейно-сливочным кремом и шоколадной начинкой. 24 порции."};
    String[] togriburchaklinarx = {"356 000", "352 000", "324 000", "336 000", "356 000", "368 000", "352 000", "179 000", "372 000", "372 000", "316 000", "360 000", "352 000", "448 000", "328 000", "396 000", "368 000", "384 000", "388 000", "388 000", "352 000", "396 000", "384 000"};

    String[] minitort = {"Мини-Бенто торт", "Мини торт Берри кейк", "Мини торт Кофе-тоффи", "Мини торт 'Лесной орех'", "Мини торт Милк-слейс", "Мини торт Рафаэлло", "Мини торт Тирамису", "Мини торт Шоколад-банан", "Торт Браво", "Торт Париж", "Торт Смородина", "⬅️ Назад"};
    String[] minitortphoto = {"https://t.me/safiapictures/78", "https://t.me/safiapictures/79", "https://t.me/safiapictures/80", "https://t.me/safiapictures/81", "https://t.me/safiapictures/83", "https://t.me/safiapictures/84", "https://t.me/safiapictures/85", "https://t.me/safiapictures/86", "https://t.me/safiapictures/87", "https://t.me/safiapictures/88", "https://t.me/safiapictures/89"};
    String[] minitortcaption = {"Мини-Бенто торт\n\n", "Мини торт Берри кейк\n\nБелый бисквит с миндальным и ванильным кремом, пропитанный ягодным сиропом. Перед употреблением рекомендуется разморозить 2 часа.", "Мини торт Кофе-тоффи\n\nШоколадно-медовые коржи с кофейно-сметанным кремом, миндаль и карамель. Перед употреблением разморозить 2 часа.", "Мини торт 'Лесной орех'\n\nШоколадный бисквит с фундуком, кофейно-шоколадным ганашем и сливочно-сметанным кремом, пропитанный сахарным сиропом. Разморозить 2 часа.", "Мини торт Милк-слейс\n\nШоколадно-медовый бисквит с кофейно-сметанным кремом и мягкими шоколадными конфетами. На 6-8 порций. Разморозить 2 часа.", "Мини торт Рафаэлло\n\nБелый бисквит, пропитанный молочным сиропом, с хрустящим миндальным слоем, миндально-ореховыми конфетами и кокосовым кремом Шантильи. Разморозить 2 часа.", "Мини торт Тирамису\n\nБелый бисквит, пропитанный кофе, с кофейным, ванильным кремом и кофейным муссом. Разморозить 2 часа.", "Мини торт Шоколад-банан\n\nШоколадный бисквит с кремом Шантильи, банановым намелаком и кусочками молочного шоколада. Разморозить 2 часа.", "Торт Браво\n\nШоколадный бисквит с карамелизированным бананом, муссом, крутилянт, кремью и тоффи-карамельной начинкой. Украшен шоколадной глазурью и декором. Разморозить 2 часа.", "Торт Париж\n\nБисквит с орехами, крем с фундуком, кофейный ганаш, молочный крем. Украшен шоколадными конфетами, кремом из ириса, шоколадом Сникерс, фундуком и песочными крошками. Разморозить 2 часа.", "Торт Смородина\n\nШоколадный бисквит с ванильным кремом 'Пломбир', пропитанный ягодным сиропом, с цельными ягодами смородины. Разморозить 2 часа."};
    String[] minitortnarx = {"144 000", "209 000", "189 000", "199 000", "185 000", "235 000", "199 000", "225 000", "225 000", "225 000", "189 000"};

    String[] pirog = {"Пирог Бокуча пахлава", "Пирог яблочно-черешневый", "Пирог черешневый", "Пирог лимонная мозаика", "Пирог Мишка", "Пирог творожная мозаика", "Пирог Творожник", "Пирог яблочный", "Пирог Мишка в упаковке", "Пирог Бокуча пахлава в упаковке", "⬅️ Назад"};
    String[] pirogphoto = {"https://t.me/safiapictures/90", "https://t.me/safiapictures/91", "https://t.me/safiapictures/92", "https://t.me/safiapictures/93", "https://t.me/safiapictures/94", "https://t.me/safiapictures/95", "https://t.me/safiapictures/96", "https://t.me/safiapictures/97", "https://t.me/safiapictures/98", "https://t.me/safiapictures/99"};
    String[] pirogcaption = {"Пирог Бокуча пахлава\n\nМеренга и бисквит с орехами, покрытый медовой глазурью и украшенный орехами. Пирог рассчитан на 24 человека.", "Пирог яблочно-черешневый\n\nБисквит и мягкая начинка из целых яблок и черешни.", "Пирог черешневый\n\nБисквит и мягкая начинка из целых черешен.", "Пирог лимонная мозаика\n\nБисквит и мягкая начинка из лимона и яблок.", "Пирог Мишка\n\nБисквит с орехами и листьями грецкого ореха.", "Пирог творожная мозаика\n\nБисквит с мягкой начинкой из свежего творога.", "Пирог Творожник\n\nБисквит с мягкой начинкой из свежего творога.", "Пирог яблочный\n\nБисквит с мягкой яблочной начинкой.", "Пирог Мишка в упаковке\n\nБисквит с орехами и листьями грецкого ореха.", "Пирог Бокуча пахлава в упаковке\n\nБисквит с меренгой и орехами, пропитанный сиропом."};
    String[] pirognarx = {"284 000", "260 000", "280 000", "208 000", "300 000", "240 000", "240 000", "208 000", "28 000", "29 000"};

    String[] yumaloqpirog = {"Пирог Малина-фрукты", "Пирог Ширмой яблоко и черешня", "⬅️ Назад"};
    String[] yumaloqpirogphoto = {"https://t.me/safiapictures/100", "https://t.me/safiapictures/101"};
    String[] yumaloqpirogcaption = {"Пирог Малина-фрукты\n\nБисквитное тесто, сметанная и малиновая начинка.", "Пирог Ширмой яблоко и черешня\n\nСлоеное тесто, начинка из черешни и яблок."};
    String[] yumaloqpirognarx = {"13 000", "59 000"};

    String[] pirojni = {"Батончик 'Картошка'", "Гранола", "Мини пирожное Amore", "Мини пирожное Апельсинка", "Мини пирожное Карамелка", "Мини пирожное 'Картошка'", "Мини пирожное Сникерс", "Мини пирожное 'Три шоколада'", "Мини пирожное Фламинго", "Мини пирожное Шоколадное", "Мини пирожное Экзот", "Пирожное Berri кейк", "Пирожное Блек розберри", "Пирожное Блек форест", "Пирожное Брауни", "Пирожное Винни", "Пирожное Типратикан", "Пирожное Картошка", "Пирожное 'Медовик в стакане'", "Пирожное Мишка", "Пирожное Павлова", "Пирожное Павлова лимонное", "Пирожное Павлова малиновое", "Павлова шоколадная", "Пирожное Сникерс", "Пирожное Тирамису", "Тирамису в баночке", "Пирожное Эстерхази", "Пирожное Реза фруктовое опера", "Пирожное Реза фруктовое лабне", "Макаронс Oreo", "Макаронс Rafaello", "Макаронс Сникерс", "Макаронс Чизкейк", "Рулет Джульетта", "Рулет Ириска", "Рулет Сникерс", "Тирамису Сан-Себастьян", "Чизкейк Сан-Себастьян", "Шоколадный Сан-Себастьян", "Чизкейк Лотус", "Чизкейк Медовый", "Чизкейк Нью-Йорк", "Чизкейк Oreo", "Чизкейк Экзотик", "Шоколад для Сан-Себастьяна", "⬅️ Назад"};
    String[] pirojniphoto = {"https://t.me/safiapictures/102", "https://t.me/safiapictures/103", "https://t.me/safiapictures/104", "https://t.me/safiapictures/105", "https://t.me/safiapictures/106", "https://t.me/safiapictures/107", "https://t.me/safiapictures/108", "https://t.me/safiapictures/109", "https://t.me/safiapictures/110", "https://t.me/safiapictures/111", "https://t.me/safiapictures/112", "https://t.me/safiapictures/113", "https://t.me/safiapictures/114", "https://t.me/safiapictures/115", "https://t.me/safiapictures/116", "https://t.me/safiapictures/117", "https://t.me/safiapictures/118", "https://t.me/safiapictures/119", "https://t.me/safiapictures/120", "https://t.me/safiapictures/121", "https://t.me/safiapictures/122", "https://t.me/safiapictures/123", "https://t.me/safiapictures/124", "https://t.me/safiapictures/125", "https://t.me/safiapictures/126", "https://t.me/safiapictures/127", "https://t.me/safiapictures/128", "https://t.me/safiapictures/129", "https://t.me/safiapictures/130", "https://t.me/safiapictures/131", "https://t.me/safiapictures/132", "https://t.me/safiapictures/133", "https://t.me/safiapictures/134", "https://t.me/safiapictures/135", "https://t.me/safiapictures/136", "https://t.me/safiapictures/137", "https://t.me/safiapictures/138", "https://t.me/safiapictures/139", "https://t.me/safiapictures/140", "https://t.me/safiapictures/141", "https://t.me/safiapictures/142", "https://t.me/safiapictures/143", "https://t.me/safiapictures/144", "https://t.me/safiapictures/145", "https://t.me/safiapictures/146", "https://t.me/safiapictures/147"};
    String[] pirojnicaption = {"Батончик\n\nШоколадный бисквит, орехи, взбитый сгущенный крем.", "Гранола\n\nГреческий йогурт, мюсли (овсяные хлопья, миндаль, семена подсолнечника, мёд, белый и чёрный изюм, молотая корица).", "Мини пирожное Amore\n\nКофейно-шоколадный бисквит, кофейный мусс, кофейно-шоколадная начинка.", "Мини пирожное Апельсинка\n\nАпельсиново-персиковый конфитюр, миндальный бисквит, мягкий крем, шоколадный декор.", "Мини пирожное Карамелка\n\nКарамельный мусс с орехами, карамельный ирис, мягкий крем, шоколадный декор.", "Мини пирожное Картошка\n\nШоколадный бисквит, шоколадный крем, шоколадный ганаш, кокосовая крошка.", "Мини пирожное Сникерс\n\nШоколадный бисквит, карамельная начинка, нуга, шоколадный мусс. Декор из шоколада, миндаля, арахиса.", "Мини пирожное Три шоколада\n\nЧерный, молочный и белый шоколадный мусс с шоколадным бисквитом, хрустящий слой, шоколадное песочное тесто.", "Мини пирожное Фламинго\n\nОсновой чизкейк, малиновый шантильи, миндаль.", "Мини пирожное Шоколадное\n\nТоффи, молочный шоколад, соленый арахис, шоколадный кекс.", "Мини пирожное Экзот\n\nМедовый корж, киви, белый шантильи крем, ананас и пюре манго-маракуйя. Глазурь и шоколадный декор.", "Пирожное Berri кейк\n\nБелый и апельсиновый бисквит, ванильный мусс, миндальный крем, фруктовая начинка.", "Пирожное Блек розберри\n\nШоколадный бисквит, малиновая пропитка, малиновый конфитюр, шоколадный ганаш, шантильи.", "Пирожное Блек форест\n\nВанильный и молочный крем Шантильи, шоколадная тарталетка, вишни, конфитюр.", "Пирожное Брауни\n\nСоленая карамель, черный шоколадный мусс, банан, кофейная пропитка, карамельный шантильи, шоколадная начинка.", "Пирожное Винни\n\nАпельсиновый бисквит, ананасовый и сырный мусс, ананасовый конфитюр.", "Пирожное Типратикан\n\nШоколадный бисквит, шоколадный крем, шоколадный ганаш, шоколадный декор, орехи.", "Пирожное Картошка\n\nШоколадный бисквит, шоколадный крем, шоколадный ганаш, кокосовая крошка.", "Пирожное Медовик в стакане\n\nМедовый бисквит, медовый заварной крем.", "Пирожное Мишка\n\nЗапеченный чизкейк Oreo и шоколадный мусс.", "Пирожное Павлова\n\nХрустящий меренговый слой, фруктовая начинка, сливочный крем.", "Пирожное Павлова лимонное\n\nЛимонный курд, сливочный крем, пломбир, меренга, физалис, зефир.", "Пирожное Павлова малиновое\n\nПломбир и шоколадный крем, меренга, малина.", "Павлова шоколадная\n\nШоколадный крем, меренга, голубика, вишня Mikado.", "Пирожное Сникерс\n\nШоколадный бисквит, нуга, карамель, молочный мусс, соленый арахис.", "Пирожное Тирамису\n\nПропитанный кофе бисквит, кофейно-кремовая начинка, ванильный крем, кофейный мусс, шантильи.", "Тирамису в баночке\n\nБисквит, кофейный крем, шоколадно-кремовая начинка, какао.", "Пирожное Эстерхази\n\nОреховые коржи (миндаль, фундук, грецкий орех), ирис, заварной крем с маслом и фундуком.", "Пирожное Реза фруктовое опера\n\nКокосовый крем, фруктовый мусс, шоколадно-фруктовый ганаш, пропитка из сиропа, миндальный бисквит.", "Пирожное Реза фруктовое лабне\n\nСырное суфле и фруктовая начинка из малины и вишни, бисквит.", "Макаронс Oreo\n\nСливочно-ванильный крем, белый шоколад, творожный сыр, миндальное тесто.", "Макаронс Rafaello\n\nКокосовый заварной крем, творожный сыр, миндальное тесто.", "Макаронс Сникерс\n\nСливочно-ванильный крем, карамельный шоколад, соленый арахис, миндально-какао тесто.", "Макаронс Чизкейк\n\nСливочно-ванильный крем, белый шоколад, творожный сыр, фруктовая начинка, миндальное тесто.", "Рулет Джульетта\n\nЙогуртовый и пломбирный крем, фруктовая прослойка с малиной, белый бисквит.", "Рулет Ириска\n\nОреховый бисквит, шоколадный ганаш, карамельный крем, шоколадный слой, орехи.", "Рулет Сникерс\n\nШантильи карамельный крем, соленая карамель с арахисом, шоколадный бисквит.", "Тирамису Сан-Себастьян\n\nКофейный чизкейк с кусочками шоколада.", "Чизкейк Сан-Себастьян\n\nЧизкейк со сливочным сыром.", "Шоколадный Сан-Себастьян\n\nЧизкейк с молочным и черным шоколадом.", "Чизкейк Лотус\n\nМягкий бисквит, основа чизкейк, паста Lotus.", "Чизкейк Медовый\n\nМедовый корж, медовый крем-чиз, медовый крем, медовая крошка.", "Чизкейк Нью-Йорк\n\nМягкий песочный корж, крем-чиз, малиновый конфитюр.", "Чизкейк Oreo\n\nШоколадный бисквит, крем-чиз Oreo, белый и молочный крем-чиз, молочный ганаш.", "Чизкейк Экзотик\n\nАпельсиновый корж, маракуйя-сырный мусс, сырная начинка, пюре манго-маракуйя.", "Шоколад для Сан-Себастьяна\n\nМолочный шоколад."};
    String[] pirojninarx = {"9 000", "29 000", "11 000", "11 000", "11 000", "7 000", "11 000", "11 000", "11 000", "11 000", "11 000", "31 000", "33 000", "27 000", "35 000", "36 000", "13 000", "9 000", "33 000", "36 000", "28 000", "28 000", "28 000", "28 000", "31 000", "28 000", "33 000", "29 000", "32 000", "28 000", "29 000", "29 000", "29 000", "29 000", "36 000", "36 000", "39 000", "37 000", "36 000", "37 000", "35 000", "35 000", "32 000", "33 000", "35 000", "7 000"};

    String[] rulet = {"Рулет Меренговый", "Рулет Меренговый с фисташками", "Рулет 'Сказка'", "⬅️ Назад"};
    String[] ruletphoto = {"https://t.me/safiapictures/148", "https://t.me/safiapictures/149", "https://t.me/safiapictures/150"};
    String[] ruletcaption = {"Рулет Меренговый\n\nВзбитые сливки и свежая малина на хрустящей мягкой меренге. Рекомендуется разморозить 2 часа перед употреблением.", "Рулет Меренговый с фисташками\n\nМорозный рулет с малиново-фисташковым кремом на фисташковой хрустящей мягкой меренге. Рекомендуется разморозить 2 часа перед употреблением.", "Рулет 'Сказка'\n\nБелый бисквит, пропитанный сахарным сиропом, натуральный масляный крем. Рекомендуется разморозить 2 часа перед употреблением."};
    String[] ruletnarx = {"209 000", "239 000", "169 000"};

    String[] ekler = {"Эклер Ваниль-малина", "Эклер Лотус-карамель", "Эклер Рафаэлло", "Эклер Тирамису", "Эклер Шандон фисташка-малина", "Эклер Шоколад-Нутелла", "⬅️ Назад"};
    String[] eklerphoto = {"https://t.me/safiapictures/151", "https://t.me/safiapictures/153", "https://t.me/safiapictures/154", "https://t.me/safiapictures/155", "https://t.me/safiapictures/156", "https://t.me/safiapictures/157"};
    String[] eklercaption = {"Эклер Ваниль-малина\n\nВанильный крем с малиной и малиновым конфитюром на заварном тесте, покрытом кракелином.", "Эклер Лотус-карамель\n\nЗаварное тесто с карамельным кремом, начинкой Lotus с орехами и карамельным хрустящим слоем.", "Эклер Рафаэлло\n\nКокосовый крем с начинкой из вафельного крюстиланта на заварном тесте.", "Эклер Тирамису\n\nКрем с кофейным сиропом и печеньем савоярди, пропитанное кофе, на заварном тесте. Украшен какао-ванильным кремом.", "Эклер Шандон фисташка-малина\n\nЗаварное тесто с кремом Шандон с фисташками и малиновым конфитюром.", "Эклер Шоколад-Нутелла\n\nЗаварное тесто с шоколадным кремом, орехово-шоколадной начинкой и шоколадным крюстиллантом."};
    String[] eklernarx = {"19 000", "23 000", "21 000", "21 000", "23 000", "20 000"};

    String[] makarons = {"Макаронс Ваниль штука", "Макаронс Шандон фисташка штука", "Макаронс Шоколад штука", "Макаронс Экзотик штука", "Макаронс Фруктовая начинка штука", "Макаронс микс 10 штук", "Макаронс микс 5 штук", "⬅️ Назад"};
    String[] makaronsphoto = {"https://t.me/safiapictures/158", "https://t.me/safiapictures/158", "https://t.me/safiapictures/158", "https://t.me/safiapictures/158", "https://t.me/safiapictures/158", "https://t.me/safiapictures/159", "https://t.me/safiapictures/160"};
    String[] makaronscaption = {"Макаронс Ваниль штука\n\nМиндальное тесто с ванильной начинкой.", "Макаронс Шандон фисташка штука\n\nМиндальное тесто с начинкой из фисташек Шандон.", "Макаронс Шоколад штука\n\nМиндальное тесто с шоколадной начинкой.", "Макаронс Экзотик штука\n\nМиндальное тесто с экзотической начинкой.", "Макаронс Фруктовая начинка штука\n\nМиндальное тесто с фруктовой начинкой.", "Макаронс микс 10 штук\n\nМиндальное тесто с разными начинками.", "Макаронс микс 5 штук\n\nМиндальное тесто с разными начинками."};
    String[] makaronsnarx = {"8 000", "8 000", "8 000", "8 000", "8 000", "75 000", "39 000"};

    String[] tayyotovqat = {"Боул с говядиной", "Боул с курицей", "Ролл с курицей", "Салат Греческий", "Салат Цезарь", "Сэндвич с мясом", "Чечевичный суп", "Сэндвич с курицей", "Сэндвич-круассан с индейкой", "Филе курицы с овощами", "⬅️ Назад"};
    String[] tayyorovqatphoto = {"https://t.me/safiapictures/161", "https://t.me/safiapictures/162", "https://t.me/safiapictures/163", "https://t.me/safiapictures/164", "https://t.me/safiapictures/165", "https://t.me/safiapictures/166", "https://t.me/safiapictures/167", "https://t.me/safiapictures/168", "https://t.me/safiapictures/169", "https://t.me/safiapictures/170"};
    String[] tayyorovqatcaption = {"Боул с говядиной\n\nМягкая говядина, вареный рис, гречка, салат айсберг, сладкая кукуруза, свежие черри, фасоль, лимон, огурцы, перепелиные яйца и несколько соусов.", "Боул с курицей\n\nКуриное мясо, вареный рис, гречка, салат айсберг, чука, сладкая кукуруза, свежие черри, фасоль, лимон, огурцы, перепелиные яйца и несколько соусов.", "Ролл с курицей\n\nКуриный ролл в мягкой лепешке с добавлением свежих помидоров, огурца, айсберга и соуса тартар.", "Салат Греческий\n\nСвежий огурец, черри, болгарский перец, лимон, сыр фета и специи на листьях салата с добавлением черных и зеленых оливок и брендового соуса.", "Салат Цезарь\n\nКуриное мясо, листья айсберга, свежие черри, хрустящие сухарики, соус 'Цезарь' и пармезан.", "Сэндвич с мясом\n\nБекон и копченое мясо говядины, мягкий сыр, айсберг, свежий огурец, помидор, патиссон и соус 'Цезарь' на хрустящем тостере.", "Чечевичный суп\n\nСытный чечевичный суп с овощами и специями.", "Сэндвич с курицей\n\nЧиабатта с куриной грудкой, запеченной с чесноком и розмарином, вялеными помидорами, листьями айсберга и огурцами.", "Сэндвич-круассан с индейкой\n\nБриош-круассан, копченая индейка, сыр Чеддер, майонез, имбирь, соевый соус, укроп, лимонный сок, листья айсберга и огурцы.", "Филе курицы с овощами\n\nБаклажан, кабачок, болгарский перец, черри, специи, чеснок и сочная куриная грудка."};
    String[] tayyorovqatnarx = {"50 000", "50 000", "26 000", "35 000", "36 000", "29 000", "23 000", "31 000", "31 000", "42 000"};

    String[] shirinlik = {"Варенье из вишни", "Варенье из ягод", "Яблочный джем", "Драже 'Кешью в шоколаде'", "Драже 'Миндаль в шоколаде'", "Драже 'Фундук в шоколаде'", "Апельсиновый кекс", "Леденец", "Леденец с игрушкой", "Маршмеллоу Радуга", "Мишка Барни", "Орешек", "Попкорн карамельный", "Попкорн шоколадный", "Сладкая игрушка Бэтмен", "Сладкая игрушка Капитан Америка", "Трубочка со сгущённым молоком", "Мини коробка Чак-чак", "Турецкий Чак-чак", "Чупа-чупс", "Чупа-чупс с мастикой", "Шоколад Safia карамельно-ореховый", "Шоколад Safia кокосовый", "⬅️ Назад"};
    String[] shirinlikphoto = {"https://t.me/safiapictures/171", "https://t.me/safiapictures/172", "https://t.me/safiapictures/173", "https://t.me/safiapictures/174", "https://t.me/safiapictures/175", "https://t.me/safiapictures/176", "https://t.me/safiapictures/177", "https://t.me/safiapictures/178", "https://t.me/safiapictures/179", "https://t.me/safiapictures/180", "https://t.me/safiapictures/181", "https://t.me/safiapictures/182", "https://t.me/safiapictures/183", "https://t.me/safiapictures/184", "https://t.me/safiapictures/185", "https://t.me/safiapictures/185", "https://t.me/safiapictures/186", "https://t.me/safiapictures/187", "https://t.me/safiapictures/188", "https://t.me/safiapictures/189", "https://t.me/safiapictures/190", "https://t.me/safiapictures/191", "https://t.me/safiapictures/191"};
    String[] shirinlikcaption = {"Варенье из вишни\n\nБез косточек, сахар, цитрусовый пектин, вода, регулятор кислотности – лимонная кислота.", "Варенье из ягод\n\nЗамороженные ягоды, сахар.", "Яблочный джем\n\nОчищенное яблочное пюре, сахар, регулятор кислотности – лимонная кислота.", "Драже Кешью в шоколаде\n\nКешью в белом шоколаде.", "Драже Миндаль в шоколаде\n\nМиндаль в темном шоколаде.", "Драже Фундук в шоколаде\n\nФундук в карамельном шоколаде.", "Апельсиновый кекс\n\nМягкий кекс с апельсиновыми цукатами.", "Леденец\n\nСахарная пудра, вода.", "Леденец с игрушкой\n\nСахарная пудра, вода, мастика.", "Маршмеллоу Радуга\n\nЯблочный сок, сахар, желатин (халяль), яйцо, глюкоза, натуральный ароматизатор, натуральный краситель.", "Мишка Барни\n\nВысший сорт муки, сахар, яйцо, ванилин, соль, шоколад.", "Орешек\n\nСгущённое молоко и ореховое тесто.", "Попкорн карамельный\n\nКарамельный попкорн.", "Попкорн шоколадный\n\nШоколадный попкорн.", "Сладкая игрушка Бэтмен\n\nСахарная пудра, вода.", "Сладкая игрушка Капитан Америка\n\nСахарная пудра, вода.", "Трубочка со сгущённым молоком\n\nСладкое вафельное тесто со сгущённым молоком.", "Мини коробка Чак-чак\n\nМини коробка с Чак-чаком.", "Турецкий Чак-чак\n\nТесто, масло, шоколадная глазурь, кунжут и варёное сгущённое молоко.", "Чупа-чупс\n\nКекс с орехами и шоколадом, покрыт молочным шоколадом.", "Чупа-чупс с мастикой\n\nКекс с орехами и шоколадом, покрыт молочным шоколадом и украшен мастикой.", "Шоколад Safia карамельно-ореховый\n\nМолочный шоколад, карамель, арахис, изюм.", "Шоколад Safia кокосовый\n\nМолочный шоколад, кокосовая начинка."};
    String[] shirinliknarx = {"32 000", "39 000", "32 000", "55 000", "49 000", "49 000", "9 000", "10 000", "16 000", "13 000", "8 000", "5 500", "35 000", "35 000", "13 000", "13 000", "14 000", "59 000", "69 000", "12 000", "17 000", "13 000", "13 000"};

    String[] pechenye = {"Бискотти классик", "Гриссини мини", "Гриссини", "Баунти мини печенье", "Лочира мини печенье", "Овсянка мини печенье", "Сушки мини печенье", "Муравейник", "Печенье Бананчики", "Печенье Баунти", "Печенье Бискотти", "Печенье Брауни", "Печенье Звезда мини", "Печенье Звезда", "Карамельное печенье", "Печенье Кета", "Печенье Кукис", "Кунжутное печенье", "Курабье мини печенье", "Лимонное печенье", "Печенье Лочира", "Луна мини печенье", "Печенье Луна", "Мазурки печенье", "Мезуми печенье", "Печенье Нутелла", "Овсянка печенье", "Палочки печенье", "Ракушка мини печенье", "Печенье Ракушка", "Рогалик с вишней мини", "Рогалик с вишней", "Рогалик с орехами", "Рогалик со сгущёнкой мини", "Рогалик со сгущёнкой", "Сушки печенье", "Печенье Шрек", "Турецкая пахлава", "Кексы без глютена", "Мини кексы с гречкой", "Кексы рисовые", "⬅️ Назад"};
    String[] pechenyephoto = {"https://t.me/safiapictures/192", "https://t.me/safiapictures/193", "https://t.me/safiapictures/194", "https://t.me/safiapictures/195", "https://t.me/safiapictures/196", "https://t.me/safiapictures/197", "https://t.me/safiapictures/198", "https://t.me/safiapictures/199", "https://t.me/safiapictures/200", "https://t.me/safiapictures/201", "https://t.me/safiapictures/202", "https://t.me/safiapictures/203", "https://t.me/safiapictures/204", "https://t.me/safiapictures/205", "https://t.me/safiapictures/206", "https://t.me/safiapictures/207", "https://t.me/safiapictures/208", "https://t.me/safiapictures/209", "https://t.me/safiapictures/210", "https://t.me/safiapictures/211", "https://t.me/safiapictures/212", "https://t.me/safiapictures/213", "https://t.me/safiapictures/214", "https://t.me/safiapictures/215", "https://t.me/safiapictures/216", "https://t.me/safiapictures/217", "https://t.me/safiapictures/218", "https://t.me/safiapictures/219", "https://t.me/safiapictures/220", "https://t.me/safiapictures/221", "https://t.me/safiapictures/222", "https://t.me/safiapictures/223", "https://t.me/safiapictures/224", "https://t.me/safiapictures/225", "https://t.me/safiapictures/226", "https://t.me/safiapictures/227", "https://t.me/safiapictures/228", "https://t.me/safiapictures/229", "https://t.me/safiapictures/230", "https://t.me/safiapictures/231", "https://t.me/safiapictures/232"};
    String[] pechenyecaption = {"Бискотти классик\n\nПесочное тесто, орехи.", "Гриссини мини\n\nСухие хлебные палочки с кунжутом.", "Гриссини\n\nСухие хлебные палочки с кунжутом.", "Мини печенье Баунти\n\nТесто с кокосом и кусочками молочного шоколада.", "Мини печенье Лочира\n\nТесто с маслом и молоком, кунжут.", "Мини печенье Овсянка\n\nПесочное тесто с овсяными хлопьями, орехами и корицей.", "Мини печенье Сушки\n\nТесто с маслом и молоком, кунжут.", "Муравейник\n\nКарамельно-медовый крем и варёное сгущённое молоко с песочным тестом.", "Печенье Бананчики\n\nПесочное тесто с безе и ореховой начинкой, украшено варёной сгущёнкой и орехами.", "Печенье Баунти\n\nТесто с кокосом и кусочками молочного шоколада.", "Печенье Бискотти\n\nПесочное тесто, орехи.", "Печенье Брауни\n\nС насыщенным шоколадным вкусом.", "Печенье Звезда мини\n\nПесочное тесто, яблоко, лимон.", "Печенье Звезда\n\nПесочное тесто, яблоко, лимон.", "Карамельное печенье\n\nПесочное тесто с ореховым карамелем.", "Печенье Кета\n\nПесочное тесто с орехами и сахаром.", "Печенье Кукис\n\nПесочное тесто с кусочками шоколада и орехами.", "Кунжутное печенье\n\nПесочное тесто с кунжутом.", "Курабье мини\n\nПесочное тесто с орехами.", "Лимонное печенье\n\nПесочное тесто с лимонной цедрой.", "Печенье Лочира\n\nТесто с маслом и молоком, кунжут.", "Луна мини\n\nПесочное тесто, приготовленное на масле.", "Печенье Луна\n\nПесочное тесто, приготовленное на масле.", "Мазурки\n\nБисквитная основа с изюмом, орехами и фундуком.", "Мезуми\n\nБезе, орехи и кусочки шоколада.", "Печенье Нутелла\n\nПесочное тесто с нутеллой и молочными шоколадными кусочками.", "Овсянка\n\nПесочное тесто с овсяными хлопьями, орехами и корицей.", "Палочки\n\nТесто, обжаренное со сливками и молоком, посыпанное кунжутом.", "Ракушка мини\n\nПесочное тесто с безе и орехами.", "Ракушка\n\nПесочное тесто с безе и орехами.", "Рогалик с вишней мини\n\nСметанное песочное тесто с вишнёвой начинкой.", "Рогалик с вишней\n\nСметанное песочное тесто с вишнёвой начинкой.", "Рогалик с орехами\n\nПесочное тесто с тертыми орехами и сахаром.", "Рогалик со сгущёнкой мини\n\nСметанное песочное тесто с начинкой из сгущённого молока.", "Рогалик со сгущёнкой\n\nСметанное песочное тесто с начинкой из сгущённого молока.", "Сушки\n\nТесто с маслом и молоком, посыпанное кунжутом.", "Печенье Шрек\n\nПесочное тесто с маслом и молоком.", "Турецкая пахлава\n\nПесочное тесто с безе, орехами и изюмом.", "Кексы без глютена\n\nГлютен-фри булочки из семечек подсолнуха, семян льна, белого кунжута, масла и воды.", "Мини кексы с гречкой\n\nБулочки из смеси гречневой муки, овсяных хлопьев, семян льна, мёда и изюма.", "Кексы рисовые\n\nБулочки из рисовой муки без глютена с семенами льна, овсяными хлопьями, мёдом и изюмом."};
    String[] pechenyenarx = {"5 000", "12 000", "21 000", "20 000", "11 000", "13 000", "12 000", "5 500", "36 000", "49 000", "33 000", "19 000", "29 000", "50 000", "19 000", "37 000", "18 000", "24 000", "29 000", "33 000", "27 000", "26 000", "48 000", "29 000", "24 000", "19 000", "27 000", "14 000", "28 000", "62 000", "28 000", "55 000", "42 000", "26 000", "55 000", "21 000", "26 000", "35 000", "34 000", "35 000", "35 000"};

    String[] qadoqekler = {"Буше Ассорти", "Буше белый шоколад мини", "Буше шоколад мини", "Мини трубочка мини", "Мини трубочка", "Мини эклер Ассорти мини", "Мини эклер Ассорти", "Мини эклер Заварной мини", "Мини эклер Заварной", "Мини эклер Цветной мини", "Мини эклер Цветной", "Мини эклер Шоколадный мини", "Мини эклер Шоколадный", "⬅️ Назад"};
    String[] qadoqeklerphoto = {"https://t.me/safiapictures/233", "https://t.me/safiapictures/234", "https://t.me/safiapictures/235", "https://t.me/safiapictures/236", "https://t.me/safiapictures/237", "https://t.me/safiapictures/238", "https://t.me/safiapictures/239", "https://t.me/safiapictures/240", "https://t.me/safiapictures/241", "https://t.me/safiapictures/242", "https://t.me/safiapictures/243", "https://t.me/safiapictures/244", "https://t.me/safiapictures/245"};
    String[] qadoqeklercaption = {"Буше Ассорти\n\nПесочное печенье, ванильный крем, шоколад.", "Буше белый шоколад мини\n\nПесочное печенье, ванильный крем, белый шоколад.", "Буше шоколад мини\n\nПесочное печенье, ванильный крем, тёмный шоколад.", "Мини трубочка мини\n\nСлоёное тесто с ванильно-сливочным кремом.", "Мини трубочка\n\nСлоёное тесто с ванильно-сливочным кремом.", "Мини эклер Ассорти мини\n\nАссорти из трёх видов эклеров: «Баунти», «Абрикосовый» и «Кофейный». Наполнены кремами Баунти, абрикосовым и кофейным.", "Мини эклер Ассорти\n\nАссорти из трёх видов эклеров: «Баунти», «Абрикосовый» и «Кофейный». Наполнены кремами Баунти, абрикосовым и кофейным.", "Мини эклер Заварной мини\n\nЗаварное тесто с масляным кремом.", "Мини эклер Заварной\n\nЗаварное тесто с масляным кремом.", "Мини эклер Цветной мини\n\nЗаварное тесто с кремом из сливок и сгущёнки (вишня/шоколад/ваниль).", "Мини эклер Цветной\n\nЗаварное тесто с кремом из сливок и сгущёнки (вишня/шоколад/ваниль).", "Мини эклер Шоколадный мини\n\nЗаварное тесто с масляным кремом, покрыто шоколадной глазурью.", "Мини эклер Шоколадный\n\nЗаварное тесто с масляным кремом, покрыто шоколадной глазурью."};
    String[] qadoqeklernarx = {"75 000", "39 000", "39 000", "25 000", "59 000", "45 000", "95 000", "25 000", "59 000", "39 000", "93 000", "31 000", "69 000"};

    String[] shirinpishiriq = {"Булочка абрикос-миндаль", "Булочка ватрушка", "Булочка конверт", "Булочка с вишней", "Булочка с маком", "Булочка малиновая", "Булочка с орехами", "Булочка яблочная", "Булочка со сгущёнкой", "Булочка с чёрной смородиной", "Булочка сочник", "Булочка творог-банан", "Пончик с абрикосом/2 шт.", "Пончик шоколадный/2 шт.", "⬅️ Назад"};
    String[] shirinpishiriqphoto = {"https://t.me/safiapictures/246", "https://t.me/safiapictures/247", "https://t.me/safiapictures/248", "https://t.me/safiapictures/249", "https://t.me/safiapictures/250", "https://t.me/safiapictures/251", "https://t.me/safiapictures/252", "https://t.me/safiapictures/253", "https://t.me/safiapictures/254", "https://t.me/safiapictures/255", "https://t.me/safiapictures/256", "https://t.me/safiapictures/257", "https://t.me/safiapictures/258", "https://t.me/safiapictures/259"};
    String[] shirinpishiriqcaption = {"Булочка абрикос-миндаль\n\nДрожжевое сдобное тесто с абрикосовой начинкой. Украшена мягкими конфетами с лимоном и лепестками миндаля.", "Булочка ватрушка\n\nСдобное тесто с творожной начинкой.", "Булочка конверт\n\nСдобное тесто с творожной начинкой.", "Булочка с вишней\n\nСдобное тесто с вишнёвой начинкой.", "Булочка с маком\n\nСдобное тесто с маковой начинкой.", "Булочка малиновая\n\nДрожжевое сдобное тесто с малиновой начинкой. Украшена крошками безе.", "Булочка с орехами\n\nСдобное тесто с ореховой начинкой.", "Булочка яблочная\n\nСдобное тесто с начинкой из нарезанных яблок.", "Булочка со сгущёнкой\n\nСдобное тесто с начинкой из варёного сгущённого молока.", "Булочка с чёрной смородиной\n\nДрожжевое сдобное тесто с начинкой из чёрной смородины. Украшена мягкими конфетами и лепестками миндаля.", "Булочка сочник\n\nПесочное тесто с творожной начинкой.", "Булочка творог-банан\n\nСдобное тесто с творогом и кусочками банана.", "Пончик с абрикосом/2 шт.\n\nЖареное в подсолнечном масле тесто с начинкой из абрикосового сиропа.", "Пончик шоколадный/2 шт.\n\nЖареное в подсолнечном масле тесто с шоколадным покрытием."};
    String[] shirinpishiriqnarx = {"12 000", "9 000", "9 000", "12 000", "10 500", "12 500", "12 000", "9 000", "12 000", "12 500", "10 000", "12 000", "18 000", "20 000"};

    String[] keks = {"Кекс апельсиновый", "Кекс с вишней", "Кекс яблочный", "⬅️ Назад"};
    String[] keksphoto = {"https://t.me/safiapictures/260", "https://t.me/safiapictures/261", "https://t.me/safiapictures/262"};
    String[] kekscaption = {"Кекс апельсиновый\n\nМягкий апельсиновый кекс с засахаренными апельсиновыми дольками. Украшен сахарной помадкой и засахаренными апельсиновыми дольками.", "Кекс с вишней\n\nШоколадно-вишневый кекс с свежей вишней. Сочетание шоколадного и ванильного теста. Украшен мягкими шоколадными конфетами и вишней.", "Кекс яблочный\n\nМягкий кекс с корицей, карамелизированными яблоками и орехами."};
    String[] keksnarx = {"85 000", "85 000", "85 000"};

    String[] tartaletka = {"Мини тарталетка", "Мини тарталетка Вольтер", "Мини тарталетка Шоколадная", "⬅️ Назад"};
    String[] tartaletkaphoto = {"https://t.me/safiapictures/263", "https://t.me/safiapictures/264", "https://t.me/safiapictures/265"};
    String[] tartaletkacaption = {"Мини тарталетка\n\nМягкое песочное тесто с орехами, наполненное шоколадным ганашем и взбитыми сливками. Украшено сезонными ягодами.", "Мини тарталетка Вольтер\n\nПесочно-миндальное тесто с начинкой из кремовой карамели с орехами: миндаль, кешью, фисташки и фундук.", "Мини тарталетка Шоколадная\n\nШоколадный ганаш с молочным шоколадом и сезонными ягодами на шоколадном песочном тесте."};
    String[] tartaletkanarx = {"8 000", "8 500", "8 000"};

    String[] qatlamali = {"Косичка с маком", "Косичка с орехами", "Круассан классический", "Круассан миндальный", "Круассан с фисташками", "Круассан шоколадный", "Круассан с сезонными фруктами", "Датская булочка с маком", "Датская булочка с орехами", "Слоёное яблочное", "Шоколадный Pain", "⬅️ Назад"};
    String[] qatlamaliphoto = {"https://t.me/safiapictures/266", "https://t.me/safiapictures/267", "https://t.me/safiapictures/268", "https://t.me/safiapictures/269", "https://t.me/safiapictures/270", "https://t.me/safiapictures/271", "https://t.me/safiapictures/272", "https://t.me/safiapictures/273", "https://t.me/safiapictures/274", "https://t.me/safiapictures/275", "https://t.me/safiapictures/276"};
    String[] qatlamalicaption = {"Косичка с маком\n\nСлоёное дрожжевое тесто с маковой начинкой, полито сахарным сиропом.", "Косичка с орехами\n\nСлоёное дрожжевое тесто с ореховой начинкой, полито сахарным сиропом.", "Круассан классический\n\nМногослойное слоёное тесто.", "Круассан миндальный\n\nМногослойное слоёное тесто с миндалем.", "Круассан с фисташками\n\nМногослойное тесто с фисташками.", "Круассан шоколадный\n\nЛёгкое слоёное тесто с шоколадно-ореховой пастой.", "Круассан с сезонными фруктами\n\nСлоёное тесто с сезонными фруктами.", "Датская булочка с маком\n\nСлоёное дрожжевое тесто с маковой начинкой, полито сиропом.", "Датская булочка с орехами\n\nСлоёное дрожжевое тесто с ореховой начинкой, полито сиропом.", "Слоёное яблочное\n\nСлоёное тесто с яблоками, корицей и сахаром с кремом патисьер.", "Шоколадный Pain\n\nСлоёное дрожжевое тесто с двумя видами шоколада и заварным кремом, пропитано медовым сиропом."};
    String[] qatlamalinarx = {"12 000", "12 000", "19 000", "29 000", "39 000", "26 000", "26 000", "4 500", "4 500", "19 000", "23 000"};

    String[] toyimli = {"Пирог с пюре и сыром", "Пирог с сыром и шпинатом", "Блинчик с мясом", "Блинчик с творогом", "Булочка с сосиской", "Жареные пельмени с мясом (упак.)", "Жареные пельмени с мясом (кг)", "Мясной обиннон", "Парамач", "Пармуда с мясом и курицей", "Пиде", "Закрытая пицца", "Открытая пицца", "Расстегай с карамелью", "Расстегай с картофелем", "Расстегай с мясом", "Расстегай с яйцом", "Слоёное с сосиской", "Сметанная самса с курицей", "Сметанная самса с мясом", "Мини самса с курицей/4 шт", "Мини самса с мясом/4 шт", "Самса с зеленью", "Самса с картофелем", "Самса с курицей", "Самса с мясом", "Самса с тыквой", "Хачапури с колбасой и сыром", "Хачапури с сыром", "Юпка", "⬅️ Назад"};
    String[] toyimliphoto = {"https://t.me/safiapictures/277", "https://t.me/safiapictures/278", "https://t.me/safiapictures/279", "https://t.me/safiapictures/280", "https://t.me/safiapictures/281", "https://t.me/safiapictures/282", "https://t.me/safiapictures/283", "https://t.me/safiapictures/284", "https://t.me/safiapictures/285", "https://t.me/safiapictures/286", "https://t.me/safiapictures/287", "https://t.me/safiapictures/288", "https://t.me/safiapictures/289", "https://t.me/safiapictures/290", "https://t.me/safiapictures/291", "https://t.me/safiapictures/292", "https://t.me/safiapictures/293", "https://t.me/safiapictures/294", "https://t.me/safiapictures/295", "https://t.me/safiapictures/296", "https://t.me/safiapictures/297", "https://t.me/safiapictures/298", "https://t.me/safiapictures/299", "https://t.me/safiapictures/300", "https://t.me/safiapictures/301", "https://t.me/safiapictures/302", "https://t.me/safiapictures/303", "https://t.me/safiapictures/304", "https://t.me/safiapictures/305", "https://t.me/safiapictures/306"};
    String[] toyimlicaption = {"Пирог с пюре и сыром\n\nЖирное тесто с начинкой из пюре и сыра.", "Пирог с сыром и шпинатом\n\nЖирное тесто с начинкой из шпината и сыра.", "Блинчик с мясом\n\nТесто с маслом и начинка из говяжьего фарша.", "Блинчик с творогом\n\nТесто с маслом и творожной начинкой.", "Булочка с сосиской\n\nТесто с начинкой из сосиски.", "Жареные пельмени с мясом (упак.)\n\nФарш из говядины, масло, жареное тесто.", "Жареные пельмени с мясом (кг)\n\nФарш из говядины, жареные в масле пельмени.", "Мясной обиннон\n\nТесто с начинкой из мяса, лука и специй.", "Парамач\n\nДрожжевое тесто с мясным фаршем и луком.", "Пармуда с мясом и курицей\n\nСметанное слоёное тесто с начинкой из мяса и курицы.", "Пиде\n\nЖирное тесто с начинкой из сыра и сулугуна.", "Закрытая пицца\n\nТесто с курицей, сыром, грибами и помидорами.", "Открытая пицца\n\nТесто с начинкой из копчёной колбасы, болгарского перца, кетчупа, оливок и сыра.", "Расстегай с карамелью\n\nЖирное тесто с начинкой из карамели.", "Расстегай с картофелем\n\nЖирное тесто с начинкой из картофельного пюре.", "Расстегай с мясом\n\nЖирное тесто с начинкой из говядины.", "Расстегай с яйцом\n\nЖирное тесто с начинкой из яйца и зелёного лука.", "Слоёное с сосиской\n\nСлоёное дрожжевое тесто с сосиской.", "Сметанная самса с курицей\n\nСметанное тесто с начинкой из курицы, лука и специй.", "Сметанная самса с мясом\n\nСметанное тесто с мясной начинкой.", "Мини самса с курицей/4 шт\n\nСлоёное тесто с начинкой из курицы, лука и специй.", "Мини самса с мясом/4 шт\n\nСлоёное тесто с мясным фаршем, луком и специями.", "Самса с зеленью\n\nСлоёное тесто с начинкой из шпината и мяты.", "Самса с картофелем\n\nСлоёное тесто с начинкой из картофеля, лука и специй.", "Самса с курицей\n\nСлоёное тесто с начинкой из курицы, лука и специй.", "Самса с мясом\n\nСлоёное тесто с начинкой из мяса, лука и специй.", "Самса с тыквой\n\nСлоёное тесто с начинкой из тыквы, лука и специй.", "Хачапури колбаса и сыр\n\nДрожжевое тесто с колбасой и сыром.", "Хачапури сырный\n\nДрожжевое тесто с сырной начинкой.", "Юпка\n\nТесто с начинкой из мясного фарша, лука и красного перца."};
    String[] toyimlinarx = {"10 000", "10 000", "10 000", "7 000", "11 000", "39 000", "129 000", "10 000", "10 000", "9 000", "15 000", "12 000", "13 000", "7 500", "7 500", "10 500", "9 000", "17 000", "8 000", "8 500", "12 000", "18 000", "7 500", "7 500", "8 000", "9 500", "7 000", "14 000", "14 000", "11 500"};

    String[] praynik = {"Имбирный пряник Капкейк", "Имбирный пряник Принц", "Имбирный пряник Принцесса", "Имбирный пряник 'Сафия'", "Имбирный пряник 'Музюрак'", "Раскрашиваемый пряник Динозаврик", "Раскрашиваемый пряник Паровозик", "Раскрашиваемый пряник Пони", "⬅️ Назад"};
    String[] zanjabilliphoto = {"https://t.me/safiapictures/307", "https://t.me/safiapictures/308", "https://t.me/safiapictures/309", "https://t.me/safiapictures/310", "https://t.me/safiapictures/311", "https://t.me/safiapictures/312", "https://t.me/safiapictures/313", "https://t.me/safiapictures/314"};
    String[] zanjabillicaption = {"Имбирный пряник Капкейк\n\nИмбирный пряник с сахарной глазурью.", "Имбирный пряник Принц\n\nИмбирный пряник с сахарной глазурью.", "Имбирный пряник Принцесса\n\nИмбирный пряник с сахарной глазурью.", "Имбирный пряник 'Сафия'\n\nИмбирный пряник с сахарной глазурью.", "Имбирный пряник 'Музюрак'\n\nИмбирный пряник с сахарной глазурью.", "Раскрашиваемый пряник Динозаврик\n\nПряник для раскрашивания.", "Раскрашиваемый пряник Паровозик\n\nПряник для раскрашивания.", "Раскрашиваемый пряник Пони\n\nПряник для раскрашивания."};
    String[] zanjabillinarx = {"27 000", "27 000", "27 000", "27 000", "27 000", "35 000", "35 000", "35 000"};

    String[] togriovqatlanish = {"ПП Пироги", "ПП Полуфабрикаты", "ПП Торты", "ПП Выпечка", "ПП Пирожные", "⬅\uFE0F В главное меню"};

    String[] ppPirog = {"ПП Пирог яблочно-вишневый", "ПП Пирог с вишней", "ПП Пирог Мишка", "ПП Пирог творог и клюква", "Пирог творожный с чиа и облепихой", "ПП Пирог яблочный", "⬅\uFE0F Назад ПП"};
    String[] ppPirogPhoto = {"https://t.me/safiapictures/315", "https://t.me/safiapictures/316", "https://t.me/safiapictures/317", "https://t.me/safiapictures/318", "https://t.me/safiapictures/319", "https://t.me/safiapictures/320"};
    String[] ppPirogCaption = {"ПП Пирог яблочно-вишневый\n\nГлютен-фри пирог с сочной начинкой из яблок и вишни.", "ПП Пирог с вишней\n\nГлютен-фри пирог с натуральной вишней и подсластителем вместо сахара.", "ПП Пирог Мишка\n\nНежный слойный десерт на основе белка и заменителя сахара из глютен-фри муки.", "ПП Пирог творог и клюква\n\nГлютен-фри пирог с творогом и сушёной клюквой.", "Пирог творожный с чиа и облепихой\n\nПирог на основе глютен-фри муки без сахара с семенами чиа и облепихой.", "ПП Пирог яблочный\n\nГлютен-фри пирог с яблоками без добавления сахара."};
    String[] ppPirogNarx = {"27 000", "26 000", "43 000", "27 000", "28 000", "27 000"};

    String[] ppPolufab = {"ПП Вареник с картофелем и грибами", "ПП Самса с зеленью и сыром /3 шт", "ПП Самса с курицей /3 шт", "ПП Самса с мясным фаршем /4 шт", "ПП Самса с мясом и луком /3 шт", "ПП Манты с мясом", "ПП Чучвара с говядиной", "⬅\uFE0F Назад ПП"};
    String[] ppPolufabPhoto = {"https://t.me/safiapictures/321", "https://t.me/safiapictures/322", "https://t.me/safiapictures/323", "https://t.me/safiapictures/324", "https://t.me/safiapictures/325", "https://t.me/safiapictures/326", "https://t.me/safiapictures/327"};
    String[] ppPolufabCaption = {"ПП Вареник с картофелем и грибами\n\nГлютен-фри вареники с картошкой и грибами.", "ПП Самса с зеленью и сыром /3 шт\n\nГлютен-фри самса с сезонными зелёными и сыром.", "ПП Самса с курицей /3 шт\n\nГлютен-фри самса с куриным мясом.", "ПП Самса с мясным фаршем /4 шт\n\nГлютен-фри самса с говяжьим фаршем.", "ПП Самса с мясом и луком /3 шт\n\nГлютен-фри самса с рубленым мясом и луком.", "ПП Манты с мясом\n\nГлютен-фри манты с говядиной.", "ПП Чучвара с говядиной\n\nГлютен-фри чучвара с говяжьим фаршем."};
    String[] ppPolufabNarx = {"39 000", "46 000", "46 000", "72 000", "53 000", "41 000", "54 000"};

    String[] ppTort = {"ПП Фруктовый мини-торт", "ПП Ягодный торт лесные ягоды", "ПП Торт Сникерс", "ПП Торт Фисташка-малина", "ПП Торт Матча-Лимон", "ПП Торт Шоколад-вишня", "⬅\uFE0F Назад ПП"};
    String[] ppTortPhoto = {"https://t.me/safiapictures/328", "https://t.me/safiapictures/329", "https://t.me/safiapictures/330", "https://t.me/safiapictures/331", "https://t.me/safiapictures/332", "https://t.me/safiapictures/333"};
    String[] ppTortCaption = {"ПП Фруктовый мини-торт\n\nГлютен-фри мини-торт с фруктами и лёгким взбитым кремом, подсластитель стевия.", "ПП Ягодный торт лесные ягоды\n\nГлютен-фри ягодный торт с клюквой, малиной и малиновым конфитюром на основе стевии.", "ПП Торт Сникерс\n\nГлютен-фри торт с арахисом, карамелью и сахарозаменителем в шоколаде.", "ПП Торт Фисташка-малина\n\nГлютен-фри торт с творожным кремом и фисташками, малиной и голубикой.", "ПП Торт Матча-Лимон\n\nГлютен-фри торт с японским чаем матча и лимонной начинкой на основе стевии.", "ПП Торт Шоколад-вишня\n\nГлютен-фри торт с вишней и шоколадом, подсластитель стевия."};
    String[] ppTortNarx = {"196 000", "223 000", "247 000", "247 000", "223 000", "212 000"};

    String[] topishiriq = {"ПП Блинчик с мясом", "ПП Киш с курицей и грибами", "ПП Киш овощной", "ПП Самса с зеленью и сыром", "ПП Самса с курицей", "ПП Самса с мясным фаршем", "ПП Самса с мясом и луком", "⬅️ Назад ПП"};
    String[] topishiriqphoto = {"https://t.me/safiapictures/334", "https://t.me/safiapictures/335", "https://t.me/safiapictures/336", "https://t.me/safiapictures/337", "https://t.me/safiapictures/338", "https://t.me/safiapictures/339", "https://t.me/safiapictures/340"};
    String[] topishiriqcaption = {"ПП Блинчик с мясом\n\nБлинчики из безглютеновой муки с начинкой из говяжьего фарша.", "ПП Киш с курицей и грибами\n\nКиш из безглютеновой муки с начинкой из курицы, грибов и сыра.", "ПП Киш овощной\n\nКиш из безглютеновой муки с болгарским перцем, помидорами, сладкой кукурузой и нутом.", "ПП Самса с зеленью и сыром\n\nСамса из безглютеновой муки с сезонной зеленью и сыром.", "ПП Самса с курицей\n\nСамса из безглютеновой муки с мягким куриным мясом.", "ПП Самса с мясным фаршем\n\nСамса из безглютеновой муки с говяжьим фаршем.", "ПП Самса с мясом и луком\n\nСамса из безглютеновой муки с рубленным мясом и луком."};
    String[] topishiriqnarx = {"15 000", "26 000", "37 000", "16 000", "16 000", "20 000", "20 000"};

    String[] ppPiroj = {"ПП Классический батончик", "ПП Шоколадный батончик", "ПП Мини профитроли", "ПП Нью-Йорк Чизкейк", "ПП Пирожное Вишенка", "ПП Пирожное Картошка", "ПП Пирожное Лесные ягоды", "ПП Пирожное \"Лесная ягода\"", "ПП Пирожное Малиновое", "ПП Пирожное Малиновое", "ПП Пирожное Медовик", "ПП Пирожное Наполеон", "ПП Пирожное \"Птичье молоко\"", "ПП Пирожное Сказка", "ПП Пирожное Чай Матча", "ПП Пирожное Меренговое", "ПП Сан-Себастьян чизкейк", "ПП Чай Матча-Лимон", "ПП Чиа пудинг без лактозы", "ПП Эклер", "⬅\uFE0F Назад ПП"};
    String[] ppPirojPhoto = {"https://t.me/safiapictures/341", "https://t.me/safiapictures/342", "https://t.me/safiapictures/343", "https://t.me/safiapictures/344", "https://t.me/safiapictures/345", "https://t.me/safiapictures/346", "https://t.me/safiapictures/347", "https://t.me/safiapictures/348", "https://t.me/safiapictures/349", "https://t.me/safiapictures/350", "https://t.me/safiapictures/351", "https://t.me/safiapictures/352", "https://t.me/safiapictures/353", "https://t.me/safiapictures/354", "https://t.me/safiapictures/355", "https://t.me/safiapictures/356", "https://t.me/safiapictures/357", "https://t.me/safiapictures/358", "https://t.me/safiapictures/359", "https://t.me/safiapictures/360"};
    String[] ppPirojCaption = {"ПП Классический батончик\n\nГречневая, овсяная каша, ореховая паста, сухофрукты, натуральный мёд.", "ПП Шоколадный батончик\n\nГречневая, овсяная каша, орехи, стевия, шоколад 72%, натуральный мёд.", "ПП Мини профитроли\n\nГлютен-фри мини-профитроли с кремом без сахара.", "ПП Нью-Йорк Чизкейк\n\nГлютен-фри чизкейк с творожным вкусом.", "ПП Пирожное Вишенка\n\nГлютен-фри пирожное на шоколадной основе без сахара.", "ПП Пирожное Картошка\n\nГлютен-фри бисквит с орехами и шоколадом.", "ПП Пирожное Лесные ягоды\n\nГлютен-фри бисквит с ягодным кремом.", "ПП Пирожное \"Лесная ягода\"\n\nГлютен-фри ягодное пирожное с малиной, клубникой и чёрной смородиной.", "ПП Пирожное Малиновое\n\nГлютен-фри бисквит с малиновым кремом и свежей малиной.", "ПП Пирожное Малиновое\n\nГлютен-фри пирожное с творожным кремом и малиной.", "ПП Пирожное Медовик\n\nГлютен-фри медовый бисквит с творожным кремом и малиновым конфитюром.", "ПП Пирожное Наполеон\n\nГлютен-фри слойное пирожное с кремом и фруктовым конфитюром.", "ПП Пирожное \"Птичье молоко\"\n\nГлютен-фри слойное пирожное с белком и сахарозаменителем.", "ПП Пирожное Сказка\n\nГлютен-фри рулет с миндальным вкусом и кремом на основе шоколада без сахара.", "ПП Пирожное Чай Матча\n\nГлютен-фри бисквит с японским чаем матча, лимонной начинкой и стевией.", "ПП Пирожное Меренговое\n\nГлютен-фри рулет с меренгой, малиной и красной смородиной.", "ПП Сан-Себастьян чизкейк\n\nГлютен-фри чизкейк с творожной и шоколадной основой без сахара.", "ПП Чай Матча-Лимон\n\nГлютен-фри бисквит с матча и лимонным кремом.", "ПП Чиа пудинг без лактозы\n\nЧиа пудинг с кокосовым молоком, манго и маракуйей.", "ПП Эклер\n\nГлютен-фри эклер с кремом из шоколада без сахара."};
    String[] ppPirojNarx = {"19 000", "17 000", "37 000", "37 000", "27 000", "15 000", "35 000", "33 000", "34 000", "23 000", "31 000", "37 000", "18 000", "37 000", "34 000", "19 000", "41 000", "33 000", "39 000", "17 000"};

    String[] yarimtayyor = {"Вареник с картофелем", "Долма с капустой", "Долма с говядиной", "Котлеты из говядины /5 шт", "Котлеты из курицы /5 шт", "Котлеты по-киевски /3 шт", "Мини-чучвара цветная", "Наггетсы /12 шт", "Чучвара из баранины", "Чучвара из говядины", "Сырники /8 шт", "Тесто для слоёного", "Тесто для самсы", "Чебурек с мясом /4 шт", "⬅\uFE0F В главное меню"};
    String[] yarimtayyorphoto = {"https://t.me/safiapictures/361", "https://t.me/safiapictures/362", "https://t.me/safiapictures/363", "https://t.me/safiapictures/364", "https://t.me/safiapictures/365", "https://t.me/safiapictures/366", "https://t.me/safiapictures/367", "https://t.me/safiapictures/368", "https://t.me/safiapictures/369", "https://t.me/safiapictures/370", "https://t.me/safiapictures/371", "https://t.me/safiapictures/372", "https://t.me/safiapictures/373", "https://t.me/safiapictures/374"};
    String[] yarimtayyorcaption = {"Вареник с картофелем\n\nМука, картофель, лук, соль, перец, сливочное масло, яйцо", "Долма с капустой\n\nГовядина, лук, рис, соль, растительное масло, китайская соль, перец, тмин, измельчённая капуста, вода", "Долма с говядиной\n\nГовядина, виноградные листья, рис, лук, соль, кинза, тмин, перец, растительное масло, вода", "Котлеты из говядины /5 шт\n\nФарш из говядины, лук, специи (без консервантов)", "Котлеты из курицы /5 шт\n\nФарш из курицы, лук, специи (без консервантов)", "Котлеты по-киевски /3 шт\n\nКуриное мясо, сливочное масло, укроп, соль, перец, панировочные сухари", "Мини-чучвара цветная\n\nТесто с добавлением свекольного, морковного и шпинатного сока, начинка из говядины, лука и специй (без консервантов)", "Наггетсы /12 шт\n\nКуриное мясо, сливочное масло, соль, перец, панировочные сухари, орегано", "Чучвара из баранины\n\nТесто, фарш из баранины, лук, специи (без консервантов)", "Чучвара из говядины\n\nТесто, фарш из говядины, лук, специи (без консервантов)", "Сырники /8 шт\n\nТворог, пшеничная мука, яйца, сахар, разрыхлитель теста", "Тесто для слоёного\n\nПшеничная мука, сливочное масло, растительное масло, сахар, соль, чистая вода", "Тесто для самсы\n\nПшеничная мука, сливочное масло, растительное масло, сахар, соль, чистая вода", "Чебурек с мясом /4 шт\n\nПшеничная мука, яйца, маргарин, говяжий жир, соль, перец, мясо говядины, лук"};
    String[] yarimtayyornarx = {"15 000", "39 000", "49 000", "70 000", "60 000", "49 000", "59 000", "29 000", "53 000", "53 000", "31 000", "24 000", "24 000", "29 000"};

    String[] non = {"Хлеб 'Бородинский'", "Хлеб 'Славянский аромат'", "Хлеб 'Спорт актив'", "Хлеб 'Тартин'", "⬅\uFE0F В главное меню"};
    String[] nonphoto = {"https://t.me/safiapictures/375", "https://t.me/safiapictures/376", "https://t.me/safiapictures/377", "https://t.me/safiapictures/378"};
    String[] noncaption = {"Хлеб 'Бородинский'\n\nПриготовлен из пшеничной и ржаной муки, с добавлением солода, дрожжей и закваски", "Хлеб 'Славянский аромат'\n\nПриготовлен из пшеничной и ржаной муки, с богатым ароматом специй, с добавлением зерна и дрожжей", "Хлеб 'Спорт актив'\n\nС добавлением семян льна, овса и моркови, приготовлен на дрожжевом тесте из пшеницы", "Хлеб 'Тартин'\n\nПриготовлен из пшеничной муки и семян льна, медленно заквашенный, дрожжи добавлены"};
    String[] nonnarx = {"15 000", "15 000", "15 000", "15 000"};

    String[] barmenyu = {"Свежевыжатые соки", "Милкшейки", "Лимонады", "Кофе", "⬅\uFE0F В главное меню"};

    String[] yangisiqilgan = {"Апельсиновый фреш", "Морковно-яблочный фреш (Safia)", "Морковный фреш (Safia)", "Яблочный фреш (Safia)", "⬅\uFE0F Назад к Бару"};
    String[] yangisiqilganphoto = {"https://t.me/safiapictures/379", "https://t.me/safiapictures/380", "https://t.me/safiapictures/381", "https://t.me/safiapictures/382"};
    String[] yangisiqilgancaption = {"Апельсиновый фреш\n\n", "Морковно-яблочный фреш (Safia)\n\n", "Морковный фреш (Safia)\n\n", "Яблочный фреш (Safia)\n\n"};
    String[] yangisiqilgannarx = {"50 000", "30 000", "22 000", "30 000"};

    String[] milksheyk = {"Банановый милкшейк", "Ванильный милкшейк", "Шоколадный милкшейк", "Малиново-ягодный милкшейк", "⬅\uFE0F Назад к Бару"};
    String[] milksheykphoto = {"https://t.me/safiapictures/383", "https://t.me/safiapictures/384", "https://t.me/safiapictures/385", "https://t.me/safiapictures/386"};
    String[] milksheykcaption = {"Банановый милкшейк\n\n", "Ванильный милкшейк\n\n", "Шоколадный милкшейк\n\n", "Малиново-ягодный милкшейк\n\n"};
    String[] milksheyknarx = {"40 000", "40 000", "45 000", "45 000"};

    String[] limonad = {"Голубой Айс-ти", "Лесная ягода лимонад", "Тархун-апельсиновый лимонад", "Фруктовый Айс-ти", "Цитрусовый лимонад", "Чёрный Айс-ти", "⬅\uFE0F Назад к Бару"};
    String[] limonadphoto = {"https://t.me/safiapictures/387", "https://t.me/safiapictures/388", "https://t.me/safiapictures/389", "https://t.me/safiapictures/390", "https://t.me/safiapictures/391", "https://t.me/safiapictures/392"};
    String[] limonadcaption = {"Голубой Айс-ти\n\n", "Лесная ягода лимонад\n\n", "Тархун-апельсиновый лимонад\n\n", "Фруктовый Айс-ти\n\n", "Цитрусовый лимонад\n\n", "Чёрный Айс-ти\n\n"};
    String[] limonadnarx = {"29 000", "35 000", "35 000", "29 000", "29 000", "29 000"};

    String[] kofe = {"Карамельный Фраппе", "Айс Американо", "Айс Латте", "Айс Капучино", "Шоколадный Фраппе", "⬅\uFE0F Назад к Бару"};
    String[] kofephoto = {"https://t.me/safiapictures/393", "https://t.me/safiapictures/394", "https://t.me/safiapictures/395", "https://t.me/safiapictures/396", "https://t.me/safiapictures/397"};
    String[] kofecaption = {"Карамельный Фраппе\n\n", "Айс Американо\n\n", "Айс Латте\n\n", "Айс Капучино\n\n", "Шоколадный Фраппе\n\n"};
    String[] kofenarx = {"24 000", "33 000", "29 000", "37 000", "37 000"};

    String[] qahva = {"Абонемент на кофе – 15", "Абонемент на кофе – 30", "⬅\uFE0F В главное меню"};
    String[] qahvaphoto = {"https://t.me/safiapictures/398", "https://t.me/safiapictures/399"};
    String[] qahvacaption = {"Абонемент на кофе – 15\n\nВ абонемент входят 15 порций кофе по выбору: Американо (150 мл), Капучино (200 мл), Латте (200 мл), Эспрессо (50 мл), Айс Латте, Айс Американо, Айс Капучино, Двойной Американо, Двойной Капучино, Двойной Эспрессо и Двойной Латте. Срок действия абонемента – 15 календарных дней (день покупки не учитывается). По истечении срока абонемент аннулируется. Выбирайте любой. Экономьте время и деньги!", "Абонемент на кофе – 30\n\nВ абонемент входят 30 порций кофе по выбору: Американо (150 мл), Капучино (200 мл), Латте (200 мл), Эспрессо (50 мл), Айс Латте, Айс Американо, Айс Капучино, Двойной Американо, Двойной Капучино, Двойной Эспрессо и Двойной Латте. Срок действия абонемента – 30 календарных дней (день покупки не учитывается). По истечении срока абонемент аннулируется. Выбирайте любой. Экономьте время и деньги!"};
    String[] qahvanarx = {"200 000", "350 000"};

    public InlineKeyboardMarkup rumenu(Long chatId) {
        SendMessage sendMessage = new SendMessage();
        sendMessage.setChatId(chatId);
        sendMessage.setText("Добро пожаловать в Сафию! Выберите один из вариантов:");

        InlineKeyboardMarkup inlineKeyboardMarkup = new InlineKeyboardMarkup();
        List<List<InlineKeyboardButton>> rowList = new ArrayList<>();

        List<InlineKeyboardButton> row = new ArrayList<>();
        InlineKeyboardButton button = new InlineKeyboardButton();
        button.setText("О нас");
        button.setCallbackData("haqidaruId");
        row.add(button);
        rowList.add(row);

        row = new ArrayList<>();
        button = new InlineKeyboardButton();
        button.setText("Меню");
        button.setCallbackData("menuruId");
        row.add(button);
        rowList.add(row);

        row = new ArrayList<>();
        button = new InlineKeyboardButton();
        button.setText("Наши ценности");
        button.setCallbackData("qadriyatruId");
        row.add(button);
        rowList.add(row);

        row = new ArrayList<>();
        button = new InlineKeyboardButton();
        button.setText("Локации");
        button.setCallbackData("manzilruId");
        row.add(button);
        rowList.add(row);

        row = new ArrayList<>();
        button = new InlineKeyboardButton();
        button.setText("Кейтеринг");
        button.setCallbackData("keytingruId");
        row.add(button);
        rowList.add(row);

        row = new ArrayList<>();
        button = new InlineKeyboardButton();
        button.setText("Изменить язык");
        button.setCallbackData("sozlamaId");
        row.add(button);
        rowList.add(row);

        inlineKeyboardMarkup.setKeyboard(rowList);
        sendMessage.setReplyMarkup(inlineKeyboardMarkup);
        return inlineKeyboardMarkup;
    }

    public SendMessage rumenu1(Long chatId) {
        SendMessage sendMessage = new SendMessage();
        sendMessage.setChatId(chatId);
        sendMessage.setText("Добро пожаловать в Сафию! Выберите один из вариантов:");

        InlineKeyboardMarkup inlineKeyboardMarkup = new InlineKeyboardMarkup();
        List<List<InlineKeyboardButton>> rowList = new ArrayList<>();

        List<InlineKeyboardButton> row = new ArrayList<>();
        InlineKeyboardButton button = new InlineKeyboardButton();
        button.setText("О нас");
        button.setCallbackData("haqidaruId");
        row.add(button);
        rowList.add(row);

        row = new ArrayList<>();
        button = new InlineKeyboardButton();
        button.setText("Меню");
        button.setCallbackData("menuruId");
        row.add(button);
        rowList.add(row);

        row = new ArrayList<>();
        button = new InlineKeyboardButton();
        button.setText("Наши ценности");
        button.setCallbackData("qadriyatruId");
        row.add(button);
        rowList.add(row);

        row = new ArrayList<>();
        button = new InlineKeyboardButton();
        button.setText("Локации");
        button.setCallbackData("manzilruId");
        row.add(button);
        rowList.add(row);

        row = new ArrayList<>();
        button = new InlineKeyboardButton();
        button.setText("Кейтеринг");
        button.setCallbackData("keytingruId");
        row.add(button);
        rowList.add(row);

        row = new ArrayList<>();
        button = new InlineKeyboardButton();
        button.setText("Изменить язык");
        button.setCallbackData("sozlamaId");
        row.add(button);
        rowList.add(row);

        inlineKeyboardMarkup.setKeyboard(rowList);
        sendMessage.setReplyMarkup(inlineKeyboardMarkup);
        return sendMessage;
    }

    public InlineKeyboardMarkup shahar(Long chatId) {
        SendMessage sendMessage = new SendMessage();
        sendMessage.setChatId(chatId);
        sendMessage.setText("Выберите город назначения:");

        InlineKeyboardMarkup inlineKeyboardMarkup = new InlineKeyboardMarkup();
        List<List<InlineKeyboardButton>> rowList = new ArrayList<>();

        List<InlineKeyboardButton> row = new ArrayList<>();

        for (String city : cities) {
            InlineKeyboardButton button = new InlineKeyboardButton();
            button.setText(city);
            button.setCallbackData(city.toLowerCase() + "Id");
            row.add(button);

            if (row.size() == 2) {
                rowList.add(row);
                row = new ArrayList<>();
            }
        }

        if (!row.isEmpty()) {
            rowList.add(row);
        }

        inlineKeyboardMarkup.setKeyboard(rowList);
        sendMessage.setReplyMarkup(inlineKeyboardMarkup);
        return inlineKeyboardMarkup;
    }

    public SendMessage shahar1(Long chatId) {
        SendMessage sendMessage = new SendMessage();
        sendMessage.setChatId(chatId);
        sendMessage.setText("Выберите город назначения:");

        InlineKeyboardMarkup inlineKeyboardMarkup = new InlineKeyboardMarkup();
        List<List<InlineKeyboardButton>> rowList = new ArrayList<>();

        List<InlineKeyboardButton> row = new ArrayList<>();

        for (String city : cities) {
            InlineKeyboardButton button = new InlineKeyboardButton();
            button.setText(city);
            button.setCallbackData(city.toLowerCase() + "Id");
            row.add(button);

            if (row.size() == 2) {
                rowList.add(row);
                row = new ArrayList<>();
            }
        }

        if (!row.isEmpty()) {
            rowList.add(row);
        }

        inlineKeyboardMarkup.setKeyboard(rowList);
        sendMessage.setReplyMarkup(inlineKeyboardMarkup);
        return sendMessage;
    }

    public SendMessage haqida(Long chatId) {
        SendMessage sendMessage = new SendMessage();
        sendMessage.setChatId(chatId);
        sendMessage.setText("Выберите тип информации, которую вы хотели бы узнать о нас.");

        ReplyKeyboardMarkup replyKeyboardMarkup = new ReplyKeyboardMarkup();
        List<KeyboardRow> rowList = new ArrayList<>();

        KeyboardRow row = new KeyboardRow();
        KeyboardButton button = new KeyboardButton();
        button.setText("Наша история");
        row.add(button);
        rowList.add(row);

        row = new KeyboardRow();
        button = new KeyboardButton();
        button.setText("Наши достижения");
        row.add(button);
        rowList.add(row);

        row = new KeyboardRow();
        button = new KeyboardButton();
        button.setText("Safia Store (\uD83C\uDDF7\uD83C\uDDFA)");
        row.add(button);
        rowList.add(row);

        row = new KeyboardRow();
        button = new KeyboardButton();
        button.setText("❌ Отмена");
        row.add(button);
        rowList.add(row);

        replyKeyboardMarkup.setKeyboard(rowList);
        replyKeyboardMarkup.setResizeKeyboard(true);
        sendMessage.setReplyMarkup(replyKeyboardMarkup);
        return sendMessage;
    }

    public SendPhoto biz(Long chatId) {
        SendPhoto sendPhoto = new SendPhoto();
        sendPhoto.setChatId(chatId);
        sendPhoto.setPhoto(new InputFile("https://t.me/safiapictures/3"));
        sendPhoto.setCaption("История Safia Cafe & Bakery – это вдохновляющий рассказ о большой любви к выпечке, которая превратилась в настоящую семейную легенду и крупнейший кондитерский бренд Узбекистана.\n" + "\n" + "\nЗа девять лет компания прошла впечатляющий путь: от локального семейного дела до международного бренда. Сегодня Safia Cafe & Bakery — это:\n" + "\n145 филиалов, включая 4 уютные кофейни в Казахстане, одна из крупнейших кондитерских фабрик в Центральной Азии,\n" + "тысячи сотрудников,\n" + "и сотни тысяч благодарных клиентов, чьи дни становятся немного слаще благодаря нашему труду.");

        InlineKeyboardMarkup inlineKeyboardMarkup = new InlineKeyboardMarkup();
        List<List<InlineKeyboardButton>> rowList = new ArrayList<>();

        List<InlineKeyboardButton> row = new ArrayList<>();
        InlineKeyboardButton button = new InlineKeyboardButton();
        button.setText("⬅\uFE0F Назад");
        button.setCallbackData("qaytbizruId");
        row.add(button);
        rowList.add(row);

        inlineKeyboardMarkup.setKeyboard(rowList);
        sendPhoto.setReplyMarkup(inlineKeyboardMarkup);
        return sendPhoto;
    }

    public SendPhoto yutuq(Long chatId) {
        SendPhoto sendPhoto = new SendPhoto();
        sendPhoto.setChatId(chatId);
        sendPhoto.setPhoto(new InputFile("https://t.me/safiapictures/4"));
        sendPhoto.setCaption("Safia Cafe&Bakery — пример успешного семейного бизнеса в Узбекистане.\n" + "\n" + "Подтверждают это многочисленные премии и награды:\n" + "\n" + "В 2024 году Safia Cafe&Bakery в 5-й раз получила премию “Бренд года”, заслужив любовь и признание наших гостей и клиентов.\n" + "\n" + "В 2023 году мы были отмечены наградой в номинации Digital Inovator в рамках маркетинговой конференции TAF2023.\n" + "\n" + "С 2021 по 2023 год Safia Cafe&Bakery не раз становился победителем Международной премии в области бренда работодателя Employer Brand Award. \n" + "\n" + "Нашим главным достижением остается возможность удовлетворять ожидания наших гостей и дарить им впечатляющий опыт.");

        InlineKeyboardMarkup inlineKeyboardMarkup = new InlineKeyboardMarkup();
        List<List<InlineKeyboardButton>> rowList = new ArrayList<>();

        List<InlineKeyboardButton> row = new ArrayList<>();
        InlineKeyboardButton button = new InlineKeyboardButton();
        button.setText("⬅\uFE0F Назад");
        button.setCallbackData("qaytbizruId");
        row.add(button);
        rowList.add(row);

        inlineKeyboardMarkup.setKeyboard(rowList);
        sendPhoto.setReplyMarkup(inlineKeyboardMarkup);
        return sendPhoto;
    }

    public SendPhoto store(Long chatId) {
        SendPhoto sendPhoto = new SendPhoto();
        sendPhoto.setChatId(chatId);
        sendPhoto.setPhoto(new InputFile("https://t.me/safiapictures/6"));
        sendPhoto.setCaption("Чтобы стать еще ближе к нашим гостям, мы запустили лимитированную коллекцию Safia Store.\n" + "\n" + "В ней вы найдете полезные вещицы с неповторимым дизайном, которые наполнят вашу жизнь и быт теплом и заботой.");

        InlineKeyboardMarkup inlineKeyboardMarkup = new InlineKeyboardMarkup();
        List<List<InlineKeyboardButton>> rowList = new ArrayList<>();

        List<InlineKeyboardButton> row = new ArrayList<>();
        InlineKeyboardButton button = new InlineKeyboardButton();
        button.setText("⬅\uFE0F Назад");
        button.setCallbackData("qaytbizruId");
        row.add(button);
        rowList.add(row);

        inlineKeyboardMarkup.setKeyboard(rowList);
        sendPhoto.setReplyMarkup(inlineKeyboardMarkup);
        return sendPhoto;
    }

    public SendMessage qadriyat(Long chatId) {
        SendMessage sendMessage = new SendMessage();
        sendMessage.setChatId(chatId);
        sendMessage.setText("Виды наших ценностей:");

        ReplyKeyboardMarkup replyKeyboardMarkup = new ReplyKeyboardMarkup();
        List<KeyboardRow> rowList = new ArrayList<>();

        KeyboardRow row = new KeyboardRow();
        KeyboardButton button = new KeyboardButton();
        button.setText("⛰ Окружающая среда");
        row.add(button);
        rowList.add(row);

        row = new KeyboardRow();
        button = new KeyboardButton();
        button.setText("👨‍👩‍👦‍👦 Семья");
        row.add(button);
        rowList.add(row);

        row = new KeyboardRow();
        button = new KeyboardButton();
        button.setText("\uD83D\uDC68\uD83C\uDFFB\u200D\uD83E\uDDBD\u200D➡\uFE0F Инклюзия");
        row.add(button);
        rowList.add(row);

        row = new KeyboardRow();
        button = new KeyboardButton();
        button.setText("❌ Отмена");
        row.add(button);
        rowList.add(row);

        replyKeyboardMarkup.setKeyboard(rowList);
        replyKeyboardMarkup.setResizeKeyboard(true);
        sendMessage.setReplyMarkup(replyKeyboardMarkup);
        return sendMessage;
    }

    public SendPhoto muhit(Long chatId) {
        SendPhoto sendPhoto = new SendPhoto();
        sendPhoto.setChatId(chatId);
        sendPhoto.setPhoto(new InputFile("https://t.me/safiapictures/7"));
        sendPhoto.setCaption("Заботясь о экологии в этом мире и времени, мы обеспечиваем устойчивое и чистое будущее для следующих поколений — это наша твёрдая цель!");

        InlineKeyboardMarkup inlineKeyboardMarkup = new InlineKeyboardMarkup();
        List<List<InlineKeyboardButton>> rowList = new ArrayList<>();

        List<InlineKeyboardButton> row = new ArrayList<>();
        InlineKeyboardButton button = new InlineKeyboardButton();
        button.setText("⬅\uFE0F Назад");
        button.setCallbackData("qaytqadrruId");
        row.add(button);
        rowList.add(row);

        inlineKeyboardMarkup.setKeyboard(rowList);
        sendPhoto.setReplyMarkup(inlineKeyboardMarkup);
        return sendPhoto;
    }

    public SendPhoto oila(Long chatId) {
        SendPhoto sendPhoto = new SendPhoto();
        sendPhoto.setChatId(chatId);
        sendPhoto.setPhoto(new InputFile("https://t.me/safiapictures/8"));
        sendPhoto.setCaption("Мы любим свою работу! Соблюдая семейные ценности, развиваем наше мастерство в кондитерском деле. Создаём праздничную атмосферу для каждого человека и его семьи. Гарантируем, что наши продукты готовятся из натуральных высококачественных ингредиентов с искренним отношением к гостям.");

        InlineKeyboardMarkup inlineKeyboardMarkup = new InlineKeyboardMarkup();
        List<List<InlineKeyboardButton>> rowList = new ArrayList<>();

        List<InlineKeyboardButton> row = new ArrayList<>();
        InlineKeyboardButton button = new InlineKeyboardButton();
        button.setText("⬅\uFE0F Назад");
        button.setCallbackData("qaytqadrruId");
        row.add(button);
        rowList.add(row);

        inlineKeyboardMarkup.setKeyboard(rowList);
        sendPhoto.setReplyMarkup(inlineKeyboardMarkup);
        return sendPhoto;
    }

    public SendPhoto inkl(Long chatId) {
        SendPhoto sendPhoto = new SendPhoto();
        sendPhoto.setChatId(chatId);
        sendPhoto.setPhoto(new InputFile("https://t.me/safiapictures/9"));
        sendPhoto.setCaption("Мы заботимся обо всех, обеспечивая рабочие места и справедливые условия труда!");

        InlineKeyboardMarkup inlineKeyboardMarkup = new InlineKeyboardMarkup();
        List<List<InlineKeyboardButton>> rowList = new ArrayList<>();

        List<InlineKeyboardButton> row = new ArrayList<>();
        InlineKeyboardButton button = new InlineKeyboardButton();
        button.setText("⬅\uFE0F Назад");
        button.setCallbackData("qaytqadrruId");
        row.add(button);
        rowList.add(row);

        inlineKeyboardMarkup.setKeyboard(rowList);
        sendPhoto.setReplyMarkup(inlineKeyboardMarkup);
        return sendPhoto;
    }

    public SendMessage keytring(Long chatId) {
        SendMessage sendMessage = new SendMessage();
        sendMessage.setChatId(chatId);
        sendMessage.setText("Виды кейтеринга:");

        ReplyKeyboardMarkup replyKeyboardMarkup = new ReplyKeyboardMarkup();
        List<KeyboardRow> rowList = new ArrayList<>();

        KeyboardRow row = new KeyboardRow();
        KeyboardButton button = new KeyboardButton();
        button.setText("Safia Catering (\uD83C\uDDF7\uD83C\uDDFA)"); // RU flag 🇷🇺
        row.add(button);
        rowList.add(row);

        row = new KeyboardRow();
        button = new KeyboardButton();
        button.setText("Наши преимущества");
        row.add(button);
        rowList.add(row);

        row = new KeyboardRow();
        button = new KeyboardButton();
        button.setText("Наши партнёры");
        row.add(button);
        rowList.add(row);

        row = new KeyboardRow();
        button = new KeyboardButton();
        button.setText("❌ Отмена");
        row.add(button);
        rowList.add(row);

        replyKeyboardMarkup.setKeyboard(rowList);
        replyKeyboardMarkup.setResizeKeyboard(true);
        sendMessage.setReplyMarkup(replyKeyboardMarkup);
        return sendMessage;
    }

    public SendPhoto catering(Long chatId) {
        SendPhoto sendPhoto = new SendPhoto();
        sendPhoto.setChatId(chatId);
        sendPhoto.setPhoto(new InputFile("https://t.me/safiapictures/10"));
        sendPhoto.setCaption("Это мероприятие мы организуем специально для вас! Мы предлагаем наши услуги как физическим, так и юридическим лицам.\n\n" + "Наши опытные повара и кондитеры обучались в лучших кулинарных учреждениях Ташкента и за рубежом. Опираясь на богатый опыт, наши мастера воплотят ваши личные идеи в реальность и предоставят необходимые консультации.");

        InlineKeyboardMarkup inlineKeyboardMarkup = new InlineKeyboardMarkup();
        List<List<InlineKeyboardButton>> rowList = new ArrayList<>();

        List<InlineKeyboardButton> row = new ArrayList<>();
        InlineKeyboardButton button = new InlineKeyboardButton();
        button.setText("⬅️ Назад");
        button.setCallbackData("qaytkeytruId"); // RU qo'shildi
        row.add(button);
        rowList.add(row);

        inlineKeyboardMarkup.setKeyboard(rowList);
        sendPhoto.setReplyMarkup(inlineKeyboardMarkup);
        return sendPhoto;
    }

    public SendPhoto afzal(Long chatId) {
        SendPhoto sendPhoto = new SendPhoto();
        sendPhoto.setChatId(chatId);
        sendPhoto.setPhoto(new InputFile("https://t.me/safiapictures/11"));
        sendPhoto.setCaption("Согласно вашим вкусам и предпочтениям, мы организуем мероприятие от выбора локации до всех этапов проведения на высоком уровне.\n\n" + "Наши декораторы с безграничной фантазией создадут уникальный дизайн, подходящий именно вашему мероприятию.\n\n" + "Качество и тонкий вкус — залог нашего успеха. Выбирая продукты, мы всегда думаем о вас и о том, чтобы мероприятие прошло на должном уровне.");

        InlineKeyboardMarkup inlineKeyboardMarkup = new InlineKeyboardMarkup();
        List<List<InlineKeyboardButton>> rowList = new ArrayList<>();

        List<InlineKeyboardButton> row = new ArrayList<>();
        InlineKeyboardButton button = new InlineKeyboardButton();
        button.setText("⬅️ Назад");
        button.setCallbackData("qaytkeytruId"); // RU qo'shildi
        row.add(button);
        rowList.add(row);

        inlineKeyboardMarkup.setKeyboard(rowList);
        sendPhoto.setReplyMarkup(inlineKeyboardMarkup);
        return sendPhoto;
    }

    public SendPhoto hamkor(Long chatId) {
        SendPhoto sendPhoto = new SendPhoto();
        sendPhoto.setChatId(chatId);
        sendPhoto.setPhoto(new InputFile("https://t.me/safiapictures/12"));
        sendPhoto.setCaption("За 6 лет мы успешно организовали ряд мероприятий различного формата.\n\n" + "Нам посчастливилось сотрудничать с компаниями и брендами: Национальный банк Узбекистана, Asiaalliance bank, World bank, Uztelecom, OKMK, Coca-cola Uzbekistan, BritishAmerican Tobacco, BeelineUzbekistan, Ucell, Humans и другие!");

        InlineKeyboardMarkup inlineKeyboardMarkup = new InlineKeyboardMarkup();
        List<List<InlineKeyboardButton>> rowList = new ArrayList<>();

        List<InlineKeyboardButton> row = new ArrayList<>();
        InlineKeyboardButton button = new InlineKeyboardButton();
        button.setText("⬅️ Назад");
        button.setCallbackData("qaytkeytruId"); // RU qo'shildi
        row.add(button);
        rowList.add(row);

        inlineKeyboardMarkup.setKeyboard(rowList);
        sendPhoto.setReplyMarkup(inlineKeyboardMarkup);
        return sendPhoto;
    }

    public SendMessage filial(Long chatId) {
        SendMessage sendMessage = new SendMessage();
        sendMessage.setChatId(chatId);
        sendMessage.setText("Все наши филиалы: \nТелефон: +998 78 113 40 40 \nВремя работы: с 08:00 до 23:00");
        return sendMessage;
    }

    public SendMessage filialone(Long chatId) {
        SendMessage sendMessage = new SendMessage();
        sendMessage.setChatId(chatId);
        sendMessage.setText("Наши филиалы: 131 (1-10)");

        InlineKeyboardMarkup inlineKeyboardMarkup = new InlineKeyboardMarkup();
        List<List<InlineKeyboardButton>> rowList = new ArrayList<>();

        List<InlineKeyboardButton> rowe = new ArrayList<>();
        InlineKeyboardButton qaytf = new InlineKeyboardButton();
        qaytf.setText("⬅\uFE0F Главное меню");
        qaytf.setCallbackData("qaytfruId");
        rowe.add(qaytf);
        rowList.add(rowe);

        List<InlineKeyboardButton> row1 = new ArrayList<>();
        InlineKeyboardButton next = new InlineKeyboardButton();
        next.setText("➡\uFE0F Далее");
        next.setCallbackData("nextoneruId");
        row1.add(next);
        rowList.add(row1);

        List<InlineKeyboardButton> row = new ArrayList<>();
        for (int i = 0; i < onetotwo.length; i++) {
            InlineKeyboardButton button = new InlineKeyboardButton();
            button.setText(onetotwo[i]);
            button.setCallbackData(onetotwo[i] + "ruId");
            row.add(button);

            if (row.size() == 2) {
                rowList.add(row);
                row = new ArrayList<>();
            }
        }
        if (!row.isEmpty()) rowList.add(row);

        inlineKeyboardMarkup.setKeyboard(rowList);
        sendMessage.setReplyMarkup(inlineKeyboardMarkup);
        return sendMessage;
    }

    public InlineKeyboardMarkup filialone1(Long chatId) {
        SendMessage sendMessage = new SendMessage();
        sendMessage.setChatId(chatId);
        sendMessage.setText("Наши филиалы: 131 (1-10)");

        InlineKeyboardMarkup inlineKeyboardMarkup = new InlineKeyboardMarkup();
        List<List<InlineKeyboardButton>> rowList = new ArrayList<>();

        List<InlineKeyboardButton> rowe = new ArrayList<>();
        InlineKeyboardButton qaytf = new InlineKeyboardButton();
        qaytf.setText("⬅\uFE0F Главное меню");
        qaytf.setCallbackData("qaytfruId");
        rowe.add(qaytf);
        rowList.add(rowe);

        List<InlineKeyboardButton> row1 = new ArrayList<>();
        InlineKeyboardButton next = new InlineKeyboardButton();
        next.setText("➡\uFE0F Далее");
        next.setCallbackData("nextoneruId");
        row1.add(next);
        rowList.add(row1);

        List<InlineKeyboardButton> row = new ArrayList<>();
        for (int i = 0; i < onetotwo.length; i++) {
            InlineKeyboardButton button = new InlineKeyboardButton();
            button.setText(onetotwo[i]);
            button.setCallbackData(onetotwo[i] + "ruId");
            row.add(button);

            if (row.size() == 2) {
                rowList.add(row);
                row = new ArrayList<>();
            }
        }
        if (!row.isEmpty()) rowList.add(row);

        inlineKeyboardMarkup.setKeyboard(rowList);
        sendMessage.setReplyMarkup(inlineKeyboardMarkup);
        return inlineKeyboardMarkup;
    }

    public InlineKeyboardMarkup filialtwo(Long chatId) {
        SendMessage sendMessage = new SendMessage();
        sendMessage.setChatId(chatId);
        sendMessage.setText("Наши филиалы: 131 (11-20)");

        InlineKeyboardMarkup inlineKeyboardMarkup = new InlineKeyboardMarkup();
        List<List<InlineKeyboardButton>> rowList = new ArrayList<>();

        List<InlineKeyboardButton> rowe = new ArrayList<>();
        InlineKeyboardButton qaytf = new InlineKeyboardButton();
        qaytf.setText("⬅\uFE0F Главное меню");
        qaytf.setCallbackData("qaytfruId");
        rowe.add(qaytf);
        rowList.add(rowe);

        List<InlineKeyboardButton> row1 = new ArrayList<>();
        InlineKeyboardButton qayt = new InlineKeyboardButton();
        qayt.setText("⬅\uFE0F Назад");
        qayt.setCallbackData("qayttworuId");
        row1.add(qayt);

        InlineKeyboardButton next = new InlineKeyboardButton();
        next.setText("➡\uFE0F Далее");
        next.setCallbackData("nexttworuId");
        row1.add(next);

        rowList.add(row1);

        List<InlineKeyboardButton> row = new ArrayList<>();
        for (int i = 0; i < twotothree.length; i++) {
            InlineKeyboardButton button = new InlineKeyboardButton();
            button.setText(twotothree[i]);
            button.setCallbackData(twotothree[i] + "ruId");
            row.add(button);

            if (row.size() == 2) {
                rowList.add(row);
                row = new ArrayList<>();
            }
        }
        if (!row.isEmpty()) rowList.add(row);

        inlineKeyboardMarkup.setKeyboard(rowList);
        sendMessage.setReplyMarkup(inlineKeyboardMarkup);
        return inlineKeyboardMarkup;
    }

    public InlineKeyboardMarkup filialthree(Long chatId) {
        SendMessage sendMessage = new SendMessage();
        sendMessage.setChatId(chatId);
        sendMessage.setText("Наши филиалы: 131 (21-30)");

        InlineKeyboardMarkup inlineKeyboardMarkup = new InlineKeyboardMarkup();
        List<List<InlineKeyboardButton>> rowList = new ArrayList<>();

        List<InlineKeyboardButton> rowe = new ArrayList<>();
        InlineKeyboardButton qaytf = new InlineKeyboardButton();
        qaytf.setText("⬅\uFE0F Главное меню");
        qaytf.setCallbackData("qaytfruId");
        rowe.add(qaytf);
        rowList.add(rowe);

        List<InlineKeyboardButton> row1 = new ArrayList<>();
        InlineKeyboardButton qayt = new InlineKeyboardButton();
        qayt.setText("⬅\uFE0F Назад");
        qayt.setCallbackData("qaytthreeruId");
        row1.add(qayt);

        InlineKeyboardButton next = new InlineKeyboardButton();
        next.setText("➡\uFE0F Далее");
        next.setCallbackData("nextthreeruId");
        row1.add(next);

        rowList.add(row1);

        List<InlineKeyboardButton> row = new ArrayList<>();
        for (int i = 0; i < threetofour.length; i++) {
            InlineKeyboardButton button = new InlineKeyboardButton();
            button.setText(threetofour[i]);
            button.setCallbackData(threetofour[i] + "ruId");
            row.add(button);

            if (row.size() == 2) {
                rowList.add(row);
                row = new ArrayList<>();
            }
        }
        if (!row.isEmpty()) rowList.add(row);

        inlineKeyboardMarkup.setKeyboard(rowList);
        sendMessage.setReplyMarkup(inlineKeyboardMarkup);
        return inlineKeyboardMarkup;
    }

    public InlineKeyboardMarkup filialfour(Long chatId) {
        SendMessage sendMessage = new SendMessage();
        sendMessage.setChatId(chatId);
        sendMessage.setText("Наши филиалы: 131 (31-40)");

        InlineKeyboardMarkup inlineKeyboardMarkup = new InlineKeyboardMarkup();
        List<List<InlineKeyboardButton>> rowList = new ArrayList<>();

        List<InlineKeyboardButton> rowe = new ArrayList<>();
        InlineKeyboardButton qaytf = new InlineKeyboardButton();
        qaytf.setText("⬅\uFE0F Главное меню");
        qaytf.setCallbackData("qaytfruId");
        rowe.add(qaytf);
        rowList.add(rowe);

        List<InlineKeyboardButton> row1 = new ArrayList<>();
        InlineKeyboardButton qayt = new InlineKeyboardButton();
        qayt.setText("⬅\uFE0F Назад");
        qayt.setCallbackData("qaytfourruId");
        row1.add(qayt);

        InlineKeyboardButton next = new InlineKeyboardButton();
        next.setText("➡\uFE0F Далее");
        next.setCallbackData("nextfourruId");
        row1.add(next);

        rowList.add(row1);

        List<InlineKeyboardButton> row = new ArrayList<>();
        for (int i = 0; i < fourtofive.length; i++) {
            InlineKeyboardButton button = new InlineKeyboardButton();
            button.setText(fourtofive[i]);
            button.setCallbackData(fourtofive[i] + "ruId");
            row.add(button);

            if (row.size() == 2) {
                rowList.add(row);
                row = new ArrayList<>();
            }
        }
        if (!row.isEmpty()) rowList.add(row);

        inlineKeyboardMarkup.setKeyboard(rowList);
        sendMessage.setReplyMarkup(inlineKeyboardMarkup);
        return inlineKeyboardMarkup;
    }

    public InlineKeyboardMarkup filialfive(Long chatId) {
        SendMessage sendMessage = new SendMessage();
        sendMessage.setChatId(chatId);
        sendMessage.setText("Наши филиалы: 131 (41-50)");

        InlineKeyboardMarkup inlineKeyboardMarkup = new InlineKeyboardMarkup();
        List<List<InlineKeyboardButton>> rowList = new ArrayList<>();

        List<InlineKeyboardButton> rowe = new ArrayList<>();
        InlineKeyboardButton qaytf = new InlineKeyboardButton();
        qaytf.setText("⬅\uFE0F Главное меню");
        qaytf.setCallbackData("qaytfruId");
        rowe.add(qaytf);
        rowList.add(rowe);

        List<InlineKeyboardButton> row1 = new ArrayList<>();
        InlineKeyboardButton qayt = new InlineKeyboardButton();
        qayt.setText("⬅\uFE0F Назад");
        qayt.setCallbackData("qaytfiveruId");
        row1.add(qayt);

        InlineKeyboardButton next = new InlineKeyboardButton();
        next.setText("➡\uFE0F Далее");
        next.setCallbackData("nextfiveruId");
        row1.add(next);

        rowList.add(row1);

        List<InlineKeyboardButton> row = new ArrayList<>();
        for (int i = 0; i < fivetosix.length; i++) {
            InlineKeyboardButton button = new InlineKeyboardButton();
            button.setText(fivetosix[i]);
            button.setCallbackData(fivetosix[i] + "ruId");
            row.add(button);

            if (row.size() == 2) {
                rowList.add(row);
                row = new ArrayList<>();
            }
        }
        if (!row.isEmpty()) rowList.add(row);

        inlineKeyboardMarkup.setKeyboard(rowList);
        sendMessage.setReplyMarkup(inlineKeyboardMarkup);
        return inlineKeyboardMarkup;
    }

    public InlineKeyboardMarkup filialsix(Long chatId) {
        SendMessage sendMessage = new SendMessage();
        sendMessage.setChatId(chatId);
        sendMessage.setText("Наши филиалы: 131 (51-60)");

        InlineKeyboardMarkup inlineKeyboardMarkup = new InlineKeyboardMarkup();
        List<List<InlineKeyboardButton>> rowList = new ArrayList<>();

        List<InlineKeyboardButton> rowe = new ArrayList<>();
        InlineKeyboardButton qaytf = new InlineKeyboardButton();
        qaytf.setText("⬅\uFE0F Главное меню");
        qaytf.setCallbackData("qaytfruId");
        rowe.add(qaytf);
        rowList.add(rowe);

        List<InlineKeyboardButton> row1 = new ArrayList<>();
        InlineKeyboardButton qayt = new InlineKeyboardButton();
        qayt.setText("⬅\uFE0F Назад");
        qayt.setCallbackData("qaytsixruId");
        row1.add(qayt);

        InlineKeyboardButton next = new InlineKeyboardButton();
        next.setText("➡\uFE0F Далее");
        next.setCallbackData("nextsixruId");
        row1.add(next);
        rowList.add(row1);

        List<InlineKeyboardButton> row = new ArrayList<>();
        for (int i = 0; i < sixtoseven.length; i++) {
            InlineKeyboardButton button = new InlineKeyboardButton();
            button.setText(sixtoseven[i]);
            button.setCallbackData(sixtoseven[i] + "ruId");
            row.add(button);

            if (row.size() == 2) {
                rowList.add(row);
                row = new ArrayList<>();
            }
        }
        if (!row.isEmpty()) rowList.add(row);

        inlineKeyboardMarkup.setKeyboard(rowList);
        sendMessage.setReplyMarkup(inlineKeyboardMarkup);
        return inlineKeyboardMarkup;
    }

    public InlineKeyboardMarkup filialseven(Long chatId) {
        SendMessage sendMessage = new SendMessage();
        sendMessage.setChatId(chatId);
        sendMessage.setText("Наши филиалы: 131 (61-70)");

        InlineKeyboardMarkup inlineKeyboardMarkup = new InlineKeyboardMarkup();
        List<List<InlineKeyboardButton>> rowList = new ArrayList<>();

        List<InlineKeyboardButton> rowe = new ArrayList<>();
        InlineKeyboardButton qaytf = new InlineKeyboardButton();
        qaytf.setText("⬅\uFE0F Главное меню");
        qaytf.setCallbackData("qaytfruId");
        rowe.add(qaytf);
        rowList.add(rowe);

        List<InlineKeyboardButton> row1 = new ArrayList<>();
        InlineKeyboardButton qayt = new InlineKeyboardButton();
        qayt.setText("⬅\uFE0F Назад");
        qayt.setCallbackData("qaytsevenruId");
        row1.add(qayt);

        InlineKeyboardButton next = new InlineKeyboardButton();
        next.setText("➡\uFE0F Далее");
        next.setCallbackData("nextsevenruId");
        row1.add(next);
        rowList.add(row1);

        List<InlineKeyboardButton> row = new ArrayList<>();
        for (int i = 0; i < seventoeight.length; i++) {
            InlineKeyboardButton button = new InlineKeyboardButton();
            button.setText(seventoeight[i]);
            button.setCallbackData(seventoeight[i] + "ruId");
            row.add(button);

            if (row.size() == 2) {
                rowList.add(row);
                row = new ArrayList<>();
            }
        }
        if (!row.isEmpty()) rowList.add(row);

        inlineKeyboardMarkup.setKeyboard(rowList);
        sendMessage.setReplyMarkup(inlineKeyboardMarkup);
        return inlineKeyboardMarkup;
    }

    public InlineKeyboardMarkup filialeight(Long chatId) {
        SendMessage sendMessage = new SendMessage();
        sendMessage.setChatId(chatId);
        sendMessage.setText("Наши филиалы: 131 (71-80)");

        InlineKeyboardMarkup inlineKeyboardMarkup = new InlineKeyboardMarkup();
        List<List<InlineKeyboardButton>> rowList = new ArrayList<>();

        List<InlineKeyboardButton> rowe = new ArrayList<>();
        InlineKeyboardButton qaytf = new InlineKeyboardButton();
        qaytf.setText("⬅\uFE0F Главное меню");
        qaytf.setCallbackData("qaytfruId");
        rowe.add(qaytf);
        rowList.add(rowe);

        List<InlineKeyboardButton> row1 = new ArrayList<>();
        InlineKeyboardButton qayt = new InlineKeyboardButton();
        qayt.setText("⬅\uFE0F Назад");
        qayt.setCallbackData("qayteightruId");
        row1.add(qayt);

        InlineKeyboardButton next = new InlineKeyboardButton();
        next.setText("➡\uFE0F Далее");
        next.setCallbackData("nexteightruId");
        row1.add(next);
        rowList.add(row1);

        List<InlineKeyboardButton> row = new ArrayList<>();
        for (int i = 0; i < eighttonine.length; i++) {
            InlineKeyboardButton button = new InlineKeyboardButton();
            button.setText(eighttonine[i]);
            button.setCallbackData(eighttonine[i] + "ruId");
            row.add(button);

            if (row.size() == 2) {
                rowList.add(row);
                row = new ArrayList<>();
            }
        }
        if (!row.isEmpty()) rowList.add(row);

        inlineKeyboardMarkup.setKeyboard(rowList);
        sendMessage.setReplyMarkup(inlineKeyboardMarkup);
        return inlineKeyboardMarkup;
    }

    public InlineKeyboardMarkup filialnine(Long chatId) {
        SendMessage sendMessage = new SendMessage();
        sendMessage.setChatId(chatId);
        sendMessage.setText("Наши филиалы: 131 (81-90)");

        InlineKeyboardMarkup inlineKeyboardMarkup = new InlineKeyboardMarkup();
        List<List<InlineKeyboardButton>> rowList = new ArrayList<>();

        List<InlineKeyboardButton> rowe = new ArrayList<>();
        InlineKeyboardButton qaytf = new InlineKeyboardButton();
        qaytf.setText("⬅\uFE0F Главное меню");
        qaytf.setCallbackData("qaytfruId");
        rowe.add(qaytf);
        rowList.add(rowe);

        List<InlineKeyboardButton> row1 = new ArrayList<>();
        InlineKeyboardButton qayt = new InlineKeyboardButton();
        qayt.setText("⬅\uFE0F Назад");
        qayt.setCallbackData("qaytnineruId");
        row1.add(qayt);

        InlineKeyboardButton next = new InlineKeyboardButton();
        next.setText("➡\uFE0F Далее");
        next.setCallbackData("nextnineruId");
        row1.add(next);
        rowList.add(row1);

        List<InlineKeyboardButton> row = new ArrayList<>();
        for (int i = 0; i < ninetoten.length; i++) {
            InlineKeyboardButton button = new InlineKeyboardButton();
            button.setText(ninetoten[i]);
            button.setCallbackData(ninetoten[i] + "ruId");
            row.add(button);

            if (row.size() == 2) {
                rowList.add(row);
                row = new ArrayList<>();
            }
        }
        if (!row.isEmpty()) rowList.add(row);

        inlineKeyboardMarkup.setKeyboard(rowList);
        sendMessage.setReplyMarkup(inlineKeyboardMarkup);
        return inlineKeyboardMarkup;
    }

    public InlineKeyboardMarkup filialten(Long chatId) {
        SendMessage sendMessage = new SendMessage();
        sendMessage.setChatId(chatId);
        sendMessage.setText("Наши филиалы: 131 (91-100)");

        InlineKeyboardMarkup inlineKeyboardMarkup = new InlineKeyboardMarkup();
        List<List<InlineKeyboardButton>> rowList = new ArrayList<>();

        List<InlineKeyboardButton> rowe = new ArrayList<>();
        InlineKeyboardButton qaytf = new InlineKeyboardButton();
        qaytf.setText("⬅\uFE0F Главное меню");
        qaytf.setCallbackData("qaytfruId");
        rowe.add(qaytf);
        rowList.add(rowe);

        List<InlineKeyboardButton> row1 = new ArrayList<>();
        InlineKeyboardButton qayt = new InlineKeyboardButton();
        qayt.setText("⬅\uFE0F Назад");
        qayt.setCallbackData("qayttenruId");
        row1.add(qayt);

        InlineKeyboardButton next = new InlineKeyboardButton();
        next.setText("➡\uFE0F Далее");
        next.setCallbackData("nexttenruId");
        row1.add(next);
        rowList.add(row1);

        List<InlineKeyboardButton> row = new ArrayList<>();
        for (int i = 0; i < tentoeleven.length; i++) {
            InlineKeyboardButton button = new InlineKeyboardButton();
            button.setText(tentoeleven[i]);
            button.setCallbackData(tentoeleven[i] + "ruId");
            row.add(button);

            if (row.size() == 2) {
                rowList.add(row);
                row = new ArrayList<>();
            }
        }
        if (!row.isEmpty()) rowList.add(row);

        inlineKeyboardMarkup.setKeyboard(rowList);
        sendMessage.setReplyMarkup(inlineKeyboardMarkup);
        return inlineKeyboardMarkup;
    }

    public InlineKeyboardMarkup filialeleven(Long chatId) {
        SendMessage sendMessage = new SendMessage();
        sendMessage.setChatId(chatId);
        sendMessage.setText("Наши филиалы: 131 (101-110)");

        InlineKeyboardMarkup inlineKeyboardMarkup = new InlineKeyboardMarkup();
        List<List<InlineKeyboardButton>> rowList = new ArrayList<>();

        List<InlineKeyboardButton> rowe = new ArrayList<>();
        InlineKeyboardButton qaytf = new InlineKeyboardButton();
        qaytf.setText("⬅\uFE0F Главное меню");
        qaytf.setCallbackData("qaytfruId");
        rowe.add(qaytf);
        rowList.add(rowe);

        List<InlineKeyboardButton> row1 = new ArrayList<>();
        InlineKeyboardButton qayt = new InlineKeyboardButton();
        qayt.setText("⬅\uFE0F Назад");
        qayt.setCallbackData("qaytelevenruId");
        row1.add(qayt);

        InlineKeyboardButton next = new InlineKeyboardButton();
        next.setText("➡\uFE0F Далее");
        next.setCallbackData("nextelevenruId");
        row1.add(next);
        rowList.add(row1);

        List<InlineKeyboardButton> row = new ArrayList<>();
        for (int i = 0; i < eleventotwelve.length; i++) {
            InlineKeyboardButton button = new InlineKeyboardButton();
            button.setText(eleventotwelve[i]);
            button.setCallbackData(eleventotwelve[i] + "ruId");
            row.add(button);

            if (row.size() == 2) {
                rowList.add(row);
                row = new ArrayList<>();
            }
        }
        if (!row.isEmpty()) rowList.add(row);

        inlineKeyboardMarkup.setKeyboard(rowList);
        sendMessage.setReplyMarkup(inlineKeyboardMarkup);
        return inlineKeyboardMarkup;
    }

    public InlineKeyboardMarkup filialtwelve(Long chatId) {
        SendMessage sendMessage = new SendMessage();
        sendMessage.setChatId(chatId);
        sendMessage.setText("Наши филиалы: 131 (111-120)");

        InlineKeyboardMarkup inlineKeyboardMarkup = new InlineKeyboardMarkup();
        List<List<InlineKeyboardButton>> rowList = new ArrayList<>();

        List<InlineKeyboardButton> rowe = new ArrayList<>();
        InlineKeyboardButton qaytf = new InlineKeyboardButton();
        qaytf.setText("⬅\uFE0F Главное меню");
        qaytf.setCallbackData("qaytfruId");
        rowe.add(qaytf);
        rowList.add(rowe);

        List<InlineKeyboardButton> row1 = new ArrayList<>();
        InlineKeyboardButton qayt = new InlineKeyboardButton();
        qayt.setText("⬅\uFE0F Назад");
        qayt.setCallbackData("qayttwelveruId");
        row1.add(qayt);

        InlineKeyboardButton next = new InlineKeyboardButton();
        next.setText("➡\uFE0F Далее");
        next.setCallbackData("nexttwelveruId");
        row1.add(next);
        rowList.add(row1);

        List<InlineKeyboardButton> row = new ArrayList<>();
        for (int i = 0; i < twelvetothirteen.length; i++) {
            InlineKeyboardButton button = new InlineKeyboardButton();
            button.setText(twelvetothirteen[i]);
            button.setCallbackData(twelvetothirteen[i] + "ruId");
            row.add(button);

            if (row.size() == 2) {
                rowList.add(row);
                row = new ArrayList<>();
            }
        }
        if (!row.isEmpty()) rowList.add(row);

        inlineKeyboardMarkup.setKeyboard(rowList);
        sendMessage.setReplyMarkup(inlineKeyboardMarkup);
        return inlineKeyboardMarkup;
    }

    public InlineKeyboardMarkup filialthirteen(Long chatId) {
        SendMessage sendMessage = new SendMessage();
        sendMessage.setChatId(chatId);
        sendMessage.setText("Наши филиалы: 131 (121-131)");

        InlineKeyboardMarkup inlineKeyboardMarkup = new InlineKeyboardMarkup();
        List<List<InlineKeyboardButton>> rowList = new ArrayList<>();

        List<InlineKeyboardButton> rowe = new ArrayList<>();
        InlineKeyboardButton qaytf = new InlineKeyboardButton();
        qaytf.setText("⬅\uFE0F Главное меню");
        qaytf.setCallbackData("qaytfruId");
        rowe.add(qaytf);
        rowList.add(rowe);

        List<InlineKeyboardButton> row1 = new ArrayList<>();
        InlineKeyboardButton qayt = new InlineKeyboardButton();
        qayt.setText("⬅\uFE0F Назад");
        qayt.setCallbackData("qaytthirteenruId");
        row1.add(qayt);
        rowList.add(row1);

        List<InlineKeyboardButton> row = new ArrayList<>();
        for (int i = 0; i < thirteentofourteen.length; i++) {
            InlineKeyboardButton button = new InlineKeyboardButton();
            button.setText(thirteentofourteen[i]);
            button.setCallbackData(thirteentofourteen[i] + "ruId");
            row.add(button);

            if (row.size() == 2) {
                rowList.add(row);
                row = new ArrayList<>();
            }
        }
        if (!row.isEmpty()) rowList.add(row);

        inlineKeyboardMarkup.setKeyboard(rowList);
        sendMessage.setReplyMarkup(inlineKeyboardMarkup);
        return inlineKeyboardMarkup;
    }

    public SendMessage tel(Long chatId) {
        SendMessage sendMessage = new SendMessage();
        sendMessage.setChatId(chatId);
        sendMessage.setText("Отправьте ваш номер телефона");

        ReplyKeyboardMarkup replyKeyboardMarkup = new ReplyKeyboardMarkup();
        List<KeyboardRow> rowList = new ArrayList<>();

        KeyboardRow row = new KeyboardRow();

        KeyboardButton mynum = new KeyboardButton();
        mynum.setText("\uD83D\uDCDE Мой номер");
        mynum.setRequestContact(true);
        row.add(mynum);
        rowList.add(row);

        replyKeyboardMarkup.setKeyboard(rowList);
        replyKeyboardMarkup.setResizeKeyboard(true);
        sendMessage.setReplyMarkup(replyKeyboardMarkup);
        return sendMessage;
    }

    public SendMessage orgmenu(Long chatId) {
        SendMessage sendMessage = new SendMessage();
        sendMessage.setChatId(chatId);
        sendMessage.setText("Выберите категорию:");

        ReplyKeyboardMarkup replyKeyboardMarkup = new ReplyKeyboardMarkup();
        List<KeyboardRow> rowList = new ArrayList<>();

        KeyboardRow row = new KeyboardRow();
        KeyboardButton bir = new KeyboardButton();
        bir.setText("\uD83C\uDF70 Вкусные сладости здесь");
        row.add(bir);
        rowList.add(row);

        KeyboardRow row1 = new KeyboardRow();
        KeyboardButton ikki = new KeyboardButton();
        ikki.setText("\uD83E\uDD57 Диетические сладости");
        row1.add(ikki);
        rowList.add(row1);

        KeyboardRow row2 = new KeyboardRow();
        KeyboardButton uch = new KeyboardButton();
        uch.setText("\uD83E\uDD5F Полуфабрикаты");
        row2.add(uch);
        rowList.add(row2);

        KeyboardRow row3 = new KeyboardRow();
        KeyboardButton tort = new KeyboardButton();
        tort.setText("\uD83E\uDD56 Австрийский хлеб");
        row3.add(tort);
        rowList.add(row3);

        KeyboardRow row4 = new KeyboardRow();
        KeyboardButton besh = new KeyboardButton();
        besh.setText("\uD83C\uDF79 Бар меню");
        row4.add(besh);
        rowList.add(row4);

        KeyboardRow row5 = new KeyboardRow();
        KeyboardButton olti = new KeyboardButton();
        olti.setText("\uD83E\uDDF8 Доставка аниматоров");
        row5.add(olti);
        rowList.add(row5);

        KeyboardRow row6 = new KeyboardRow();
        KeyboardButton yetti = new KeyboardButton();
        yetti.setText("☕\uFE0F Кофейные абонементы");
        row6.add(yetti);
        rowList.add(row6);

        KeyboardRow row7 = new KeyboardRow();
        KeyboardButton sakkiz = new KeyboardButton();
        sakkiz.setText("❌ Отмена");
        row7.add(sakkiz);
        rowList.add(row7);

        KeyboardButton savat = new KeyboardButton();
        savat.setText("\uD83D\uDED2 Корзина");
        row7.add(savat);

        replyKeyboardMarkup.setKeyboard(rowList);
        replyKeyboardMarkup.setResizeKeyboard(true);
        sendMessage.setReplyMarkup(replyKeyboardMarkup);
        return sendMessage;
    }

    public SendMessage mazali(Long chatId) {
        SendMessage sendMessage = new SendMessage();
        sendMessage.setChatId(chatId);
        sendMessage.setText("Вкусные сладости здесь");

        ReplyKeyboardMarkup replyKeyboardMarkup = new ReplyKeyboardMarkup();
        List<KeyboardRow> rowList = new ArrayList<>();

        KeyboardRow row = new KeyboardRow();
        for (int i = 0; i < mazali.length; i++) {
            KeyboardButton button = new KeyboardButton();
            button.setText(mazali[i]);
            row.add(button);

            if (row.size() == 2) {
                rowList.add(row);
                row = new KeyboardRow();
            }
        }
        if (!row.isEmpty()) rowList.add(row);

        replyKeyboardMarkup.setKeyboard(rowList);
        replyKeyboardMarkup.setResizeKeyboard(true);
        sendMessage.setReplyMarkup(replyKeyboardMarkup);
        return sendMessage;
    }

    public SendMessage yumaloqtort(Long chatId) {
        SendMessage sendMessage = new SendMessage();
        sendMessage.setChatId(chatId);
        sendMessage.setText("Круглые торты");

        ReplyKeyboardMarkup replyKeyboardMarkup = new ReplyKeyboardMarkup();
        List<KeyboardRow> rowList = new ArrayList<>();

        KeyboardRow row = new KeyboardRow();
        for (int i = 0; i < yumaloqtort.length; i++) {
            KeyboardButton button = new KeyboardButton();
            button.setText(yumaloqtort[i]);
            row.add(button);

            if (row.size() == 2) {
                rowList.add(row);
                row = new KeyboardRow();
            }
        }
        if (!row.isEmpty()) rowList.add(row);

        replyKeyboardMarkup.setKeyboard(rowList);
        replyKeyboardMarkup.setResizeKeyboard(true);
        sendMessage.setReplyMarkup(replyKeyboardMarkup);
        return sendMessage;
    }

    public SendMessage togriburchakli(Long chatId) {
        SendMessage sendMessage = new SendMessage();
        sendMessage.setChatId(chatId);
        sendMessage.setText("Прямоугольные торты");

        ReplyKeyboardMarkup replyKeyboardMarkup = new ReplyKeyboardMarkup();
        List<KeyboardRow> rowList = new ArrayList<>();

        KeyboardRow row = new KeyboardRow();
        for (int i = 0; i < togriburchakli.length; i++) {
            KeyboardButton button = new KeyboardButton();
            button.setText(togriburchakli[i]);
            row.add(button);

            if (row.size() == 2) {
                rowList.add(row);
                row = new KeyboardRow();
            }
        }
        if (!row.isEmpty()) rowList.add(row);

        replyKeyboardMarkup.setKeyboard(rowList);
        replyKeyboardMarkup.setResizeKeyboard(true);
        sendMessage.setReplyMarkup(replyKeyboardMarkup);
        return sendMessage;
    }

    public SendMessage minitort(Long chatId) {
        SendMessage sendMessage = new SendMessage();
        sendMessage.setChatId(chatId);
        sendMessage.setText("Мини-торты");

        ReplyKeyboardMarkup replyKeyboardMarkup = new ReplyKeyboardMarkup();
        List<KeyboardRow> rowList = new ArrayList<>();

        KeyboardRow row = new KeyboardRow();
        for (int i = 0; i < minitort.length; i++) {
            KeyboardButton button = new KeyboardButton();
            button.setText(minitort[i]);
            row.add(button);

            if (row.size() == 2) {
                rowList.add(row);
                row = new KeyboardRow();
            }
        }
        if (!row.isEmpty()) rowList.add(row);

        replyKeyboardMarkup.setKeyboard(rowList);
        replyKeyboardMarkup.setResizeKeyboard(true);
        sendMessage.setReplyMarkup(replyKeyboardMarkup);
        return sendMessage;
    }

    public SendMessage kattapirog(Long chatId) {
        SendMessage sendMessage = new SendMessage();
        sendMessage.setChatId(chatId);
        sendMessage.setText("Большие пироги");

        ReplyKeyboardMarkup replyKeyboardMarkup = new ReplyKeyboardMarkup();
        List<KeyboardRow> rowList = new ArrayList<>();

        KeyboardRow row = new KeyboardRow();
        for (int i = 0; i < pirog.length; i++) {
            KeyboardButton button = new KeyboardButton();
            button.setText(pirog[i]);
            row.add(button);

            if (row.size() == 2) {
                rowList.add(row);
                row = new KeyboardRow();
            }
        }
        if (!row.isEmpty()) rowList.add(row);

        replyKeyboardMarkup.setKeyboard(rowList);
        replyKeyboardMarkup.setResizeKeyboard(true);
        sendMessage.setReplyMarkup(replyKeyboardMarkup);
        return sendMessage;
    }

    public SendMessage yumaloqpirog(Long chatId) {
        SendMessage sendMessage = new SendMessage();
        sendMessage.setChatId(chatId);
        sendMessage.setText("Круглые пироги");

        ReplyKeyboardMarkup replyKeyboardMarkup = new ReplyKeyboardMarkup();
        List<KeyboardRow> rowList = new ArrayList<>();

        KeyboardRow row = new KeyboardRow();
        for (int i = 0; i < yumaloqpirog.length; i++) {
            KeyboardButton button = new KeyboardButton();
            button.setText(yumaloqpirog[i]);
            row.add(button);

            if (row.size() == 2) {
                rowList.add(row);
                row = new KeyboardRow();
            }
        }
        if (!row.isEmpty()) rowList.add(row);

        replyKeyboardMarkup.setKeyboard(rowList);
        replyKeyboardMarkup.setResizeKeyboard(true);
        sendMessage.setReplyMarkup(replyKeyboardMarkup);
        return sendMessage;
    }

    public SendMessage pirojniy(Long chatId) {
        SendMessage sendMessage = new SendMessage();
        sendMessage.setChatId(chatId);
        sendMessage.setText("Пирожные");

        ReplyKeyboardMarkup replyKeyboardMarkup = new ReplyKeyboardMarkup();
        List<KeyboardRow> rowList = new ArrayList<>();

        KeyboardRow row = new KeyboardRow();
        for (int i = 0; i < pirojni.length; i++) {
            KeyboardButton button = new KeyboardButton();
            button.setText(pirojni[i]);
            row.add(button);

            if (row.size() == 2) {
                rowList.add(row);
                row = new KeyboardRow();
            }
        }
        if (!row.isEmpty()) rowList.add(row);

        replyKeyboardMarkup.setKeyboard(rowList);
        replyKeyboardMarkup.setResizeKeyboard(true);
        sendMessage.setReplyMarkup(replyKeyboardMarkup);
        return sendMessage;
    }

    public SendMessage rulet(Long chatId) {
        SendMessage sendMessage = new SendMessage();
        sendMessage.setChatId(chatId);
        sendMessage.setText("Рулеты");

        ReplyKeyboardMarkup replyKeyboardMarkup = new ReplyKeyboardMarkup();
        List<KeyboardRow> rowList = new ArrayList<>();

        KeyboardRow row = new KeyboardRow();
        for (int i = 0; i < rulet.length; i++) {
            KeyboardButton button = new KeyboardButton();
            button.setText(rulet[i]);
            row.add(button);

            if (row.size() == 2) {
                rowList.add(row);
                row = new KeyboardRow();
            }
        }
        if (!row.isEmpty()) rowList.add(row);

        replyKeyboardMarkup.setKeyboard(rowList);
        replyKeyboardMarkup.setResizeKeyboard(true);
        sendMessage.setReplyMarkup(replyKeyboardMarkup);
        return sendMessage;
    }

    public SendMessage ekler(Long chatId) {
        SendMessage sendMessage = new SendMessage();
        sendMessage.setChatId(chatId);
        sendMessage.setText("Эклеры");

        ReplyKeyboardMarkup replyKeyboardMarkup = new ReplyKeyboardMarkup();
        List<KeyboardRow> rowList = new ArrayList<>();

        KeyboardRow row = new KeyboardRow();
        for (int i = 0; i < ekler.length; i++) {
            KeyboardButton button = new KeyboardButton();
            button.setText(ekler[i]);
            row.add(button);

            if (row.size() == 2) {
                rowList.add(row);
                row = new KeyboardRow();
            }
        }
        if (!row.isEmpty()) rowList.add(row);

        replyKeyboardMarkup.setKeyboard(rowList);
        replyKeyboardMarkup.setResizeKeyboard(true);
        sendMessage.setReplyMarkup(replyKeyboardMarkup);
        return sendMessage;
    }

    public SendMessage makarons(Long chatId) {
        SendMessage sendMessage = new SendMessage();
        sendMessage.setChatId(chatId);
        sendMessage.setText("Макароны");

        ReplyKeyboardMarkup replyKeyboardMarkup = new ReplyKeyboardMarkup();
        List<KeyboardRow> rowList = new ArrayList<>();

        KeyboardRow row = new KeyboardRow();
        for (int i = 0; i < makarons.length; i++) {
            KeyboardButton button = new KeyboardButton();
            button.setText(makarons[i]);
            row.add(button);

            if (row.size() == 2) {
                rowList.add(row);
                row = new KeyboardRow();
            }
        }
        if (!row.isEmpty()) rowList.add(row);

        replyKeyboardMarkup.setKeyboard(rowList);
        replyKeyboardMarkup.setResizeKeyboard(true);
        sendMessage.setReplyMarkup(replyKeyboardMarkup);
        return sendMessage;
    }

    public SendMessage tayyortaom(Long chatId) {
        SendMessage sendMessage = new SendMessage();
        sendMessage.setChatId(chatId);
        sendMessage.setText("Готовые блюда");

        ReplyKeyboardMarkup replyKeyboardMarkup = new ReplyKeyboardMarkup();
        List<KeyboardRow> rowList = new ArrayList<>();

        KeyboardRow row = new KeyboardRow();
        for (int i = 0; i < tayyotovqat.length; i++) {
            KeyboardButton button = new KeyboardButton();
            button.setText(tayyotovqat[i]);
            row.add(button);

            if (row.size() == 2) {
                rowList.add(row);
                row = new KeyboardRow();
            }
        }
        if (!row.isEmpty()) rowList.add(row);

        replyKeyboardMarkup.setKeyboard(rowList);
        replyKeyboardMarkup.setResizeKeyboard(true);
        sendMessage.setReplyMarkup(replyKeyboardMarkup);
        return sendMessage;
    }

    public SendMessage shirinlik(Long chatId) {
        SendMessage sendMessage = new SendMessage();
        sendMessage.setChatId(chatId);
        sendMessage.setText("Сладости");

        ReplyKeyboardMarkup replyKeyboardMarkup = new ReplyKeyboardMarkup();
        List<KeyboardRow> rowList = new ArrayList<>();

        KeyboardRow row = new KeyboardRow();
        for (int i = 0; i < shirinlik.length; i++) {
            KeyboardButton button = new KeyboardButton();
            button.setText(shirinlik[i]);
            row.add(button);

            if (row.size() == 2) {
                rowList.add(row);
                row = new KeyboardRow();
            }
        }
        if (!row.isEmpty()) rowList.add(row);

        replyKeyboardMarkup.setKeyboard(rowList);
        replyKeyboardMarkup.setResizeKeyboard(true);
        sendMessage.setReplyMarkup(replyKeyboardMarkup);
        return sendMessage;
    }

    public SendMessage pechenye(Long chatId) {
        SendMessage sendMessage = new SendMessage();
        sendMessage.setChatId(chatId);
        sendMessage.setText("Печенье");

        ReplyKeyboardMarkup replyKeyboardMarkup = new ReplyKeyboardMarkup();
        List<KeyboardRow> rowList = new ArrayList<>();

        KeyboardRow row = new KeyboardRow();
        for (int i = 0; i < pechenye.length; i++) {
            KeyboardButton button = new KeyboardButton();
            button.setText(pechenye[i]);
            row.add(button);

            if (row.size() == 2) {
                rowList.add(row);
                row = new KeyboardRow();
            }
        }
        if (!row.isEmpty()) rowList.add(row);

        replyKeyboardMarkup.setKeyboard(rowList);
        replyKeyboardMarkup.setResizeKeyboard(true);
        sendMessage.setReplyMarkup(replyKeyboardMarkup);
        return sendMessage;
    }

    public SendMessage qadoqekler(Long chatId) {
        SendMessage sendMessage = new SendMessage();
        sendMessage.setChatId(chatId);
        sendMessage.setText("Эклеры в упаковке");

        ReplyKeyboardMarkup replyKeyboardMarkup = new ReplyKeyboardMarkup();
        List<KeyboardRow> rowList = new ArrayList<>();

        KeyboardRow row = new KeyboardRow();
        for (int i = 0; i < qadoqekler.length; i++) {
            KeyboardButton button = new KeyboardButton();
            button.setText(qadoqekler[i]);
            row.add(button);

            if (row.size() == 2) {
                rowList.add(row);
                row = new KeyboardRow();
            }
        }
        if (!row.isEmpty()) rowList.add(row);

        replyKeyboardMarkup.setKeyboard(rowList);
        replyKeyboardMarkup.setResizeKeyboard(true);
        sendMessage.setReplyMarkup(replyKeyboardMarkup);
        return sendMessage;
    }

    public SendMessage shirinpishiriq(Long chatId) {
        SendMessage sendMessage = new SendMessage();
        sendMessage.setChatId(chatId);
        sendMessage.setText("Сладкая выпечка");

        ReplyKeyboardMarkup replyKeyboardMarkup = new ReplyKeyboardMarkup();
        List<KeyboardRow> rowList = new ArrayList<>();

        KeyboardRow row = new KeyboardRow();
        for (int i = 0; i < shirinpishiriq.length; i++) {
            KeyboardButton button = new KeyboardButton();
            button.setText(shirinpishiriq[i]);
            row.add(button);

            if (row.size() == 2) {
                rowList.add(row);
                row = new KeyboardRow();
            }
        }
        if (!row.isEmpty()) rowList.add(row);

        replyKeyboardMarkup.setKeyboard(rowList);
        replyKeyboardMarkup.setResizeKeyboard(true);
        sendMessage.setReplyMarkup(replyKeyboardMarkup);
        return sendMessage;
    }

    public SendMessage keks(Long chatId) {
        SendMessage sendMessage = new SendMessage();
        sendMessage.setChatId(chatId);
        sendMessage.setText("Кексы");

        ReplyKeyboardMarkup replyKeyboardMarkup = new ReplyKeyboardMarkup();
        List<KeyboardRow> rowList = new ArrayList<>();

        KeyboardRow row = new KeyboardRow();
        for (int i = 0; i < keks.length; i++) {
            KeyboardButton button = new KeyboardButton();
            button.setText(keks[i]);
            row.add(button);

            if (row.size() == 2) {
                rowList.add(row);
                row = new KeyboardRow();
            }
        }
        if (!row.isEmpty()) rowList.add(row);

        replyKeyboardMarkup.setKeyboard(rowList);
        replyKeyboardMarkup.setResizeKeyboard(true);
        sendMessage.setReplyMarkup(replyKeyboardMarkup);
        return sendMessage;
    }

    public SendMessage tartaletka(Long chatId) {
        SendMessage sendMessage = new SendMessage();
        sendMessage.setChatId(chatId);
        sendMessage.setText("Тарталетки");

        ReplyKeyboardMarkup replyKeyboardMarkup = new ReplyKeyboardMarkup();
        List<KeyboardRow> rowList = new ArrayList<>();

        KeyboardRow row = new KeyboardRow();
        for (int i = 0; i < tartaletka.length; i++) {
            KeyboardButton button = new KeyboardButton();
            button.setText(tartaletka[i]);
            row.add(button);

            if (row.size() == 2) {
                rowList.add(row);
                row = new KeyboardRow();
            }
        }
        if (!row.isEmpty()) rowList.add(row);

        replyKeyboardMarkup.setKeyboard(rowList);
        replyKeyboardMarkup.setResizeKeyboard(true);
        sendMessage.setReplyMarkup(replyKeyboardMarkup);
        return sendMessage;
    }

    public SendMessage qatlamali(Long chatId) {
        SendMessage sendMessage = new SendMessage();
        sendMessage.setChatId(chatId);
        sendMessage.setText("Слоёная выпечка");

        ReplyKeyboardMarkup replyKeyboardMarkup = new ReplyKeyboardMarkup();
        List<KeyboardRow> rowList = new ArrayList<>();

        KeyboardRow row = new KeyboardRow();
        for (int i = 0; i < qatlamali.length; i++) {
            KeyboardButton button = new KeyboardButton();
            button.setText(qatlamali[i]);
            row.add(button);

            if (row.size() == 2) {
                rowList.add(row);
                row = new KeyboardRow();
            }
        }
        if (!row.isEmpty()) rowList.add(row);

        replyKeyboardMarkup.setKeyboard(rowList);
        replyKeyboardMarkup.setResizeKeyboard(true);
        sendMessage.setReplyMarkup(replyKeyboardMarkup);
        return sendMessage;
    }

    public SendMessage toyimli(Long chatId) {
        SendMessage sendMessage = new SendMessage();
        sendMessage.setChatId(chatId);
        sendMessage.setText("Сытная выпечка");

        ReplyKeyboardMarkup replyKeyboardMarkup = new ReplyKeyboardMarkup();
        List<KeyboardRow> rowList = new ArrayList<>();

        KeyboardRow row = new KeyboardRow();
        for (int i = 0; i < toyimli.length; i++) {
            KeyboardButton button = new KeyboardButton();
            button.setText(toyimli[i]);
            row.add(button);

            if (row.size() == 2) {
                rowList.add(row);
                row = new KeyboardRow();
            }
        }
        if (!row.isEmpty()) rowList.add(row);

        replyKeyboardMarkup.setKeyboard(rowList);
        replyKeyboardMarkup.setResizeKeyboard(true);
        sendMessage.setReplyMarkup(replyKeyboardMarkup);
        return sendMessage;
    }

    public SendMessage zanjabilli(Long chatId) {
        SendMessage sendMessage = new SendMessage();
        sendMessage.setChatId(chatId);
        sendMessage.setText("Имбирная выпечка");

        ReplyKeyboardMarkup replyKeyboardMarkup = new ReplyKeyboardMarkup();
        List<KeyboardRow> rowList = new ArrayList<>();

        KeyboardRow row = new KeyboardRow();
        for (int i = 0; i < praynik.length; i++) {
            KeyboardButton button = new KeyboardButton();
            button.setText(praynik[i]);
            row.add(button);

            if (row.size() == 2) {
                rowList.add(row);
                row = new KeyboardRow();
            }
        }
        if (!row.isEmpty()) rowList.add(row);

        replyKeyboardMarkup.setKeyboard(rowList);
        replyKeyboardMarkup.setResizeKeyboard(true);
        sendMessage.setReplyMarkup(replyKeyboardMarkup);
        return sendMessage;
    }

    public SendMessage togriovqatlanish(Long chatId) {
        SendMessage sendMessage = new SendMessage();
        sendMessage.setChatId(chatId);
        sendMessage.setText("Сладости правильного питания");

        ReplyKeyboardMarkup replyKeyboardMarkup = new ReplyKeyboardMarkup();
        List<KeyboardRow> rowList = new ArrayList<>();

        KeyboardRow row = new KeyboardRow();
        for (int i = 0; i < togriovqatlanish.length; i++) {
            KeyboardButton button = new KeyboardButton();
            button.setText(togriovqatlanish[i]);
            row.add(button);

            if (row.size() == 2) {
                rowList.add(row);
                row = new KeyboardRow();
            }
        }
        if (!row.isEmpty()) rowList.add(row);

        replyKeyboardMarkup.setKeyboard(rowList);
        replyKeyboardMarkup.setResizeKeyboard(true);
        sendMessage.setReplyMarkup(replyKeyboardMarkup);
        return sendMessage;
    }

    public SendMessage topirog(Long chatId) {
        SendMessage sendMessage = new SendMessage();
        sendMessage.setChatId(chatId);
        sendMessage.setText("ПП Пироги");

        ReplyKeyboardMarkup replyKeyboardMarkup = new ReplyKeyboardMarkup();
        List<KeyboardRow> rowList = new ArrayList<>();

        KeyboardRow row = new KeyboardRow();
        for (int i = 0; i < ppPirog.length; i++) {
            KeyboardButton button = new KeyboardButton();
            button.setText(ppPirog[i]);
            row.add(button);

            if (row.size() == 2) {
                rowList.add(row);
                row = new KeyboardRow();
            }
        }
        if (!row.isEmpty()) rowList.add(row);

        replyKeyboardMarkup.setKeyboard(rowList);
        replyKeyboardMarkup.setResizeKeyboard(true);
        sendMessage.setReplyMarkup(replyKeyboardMarkup);
        return sendMessage;
    }

    public SendMessage toyarimtayyor(Long chatId) {
        SendMessage sendMessage = new SendMessage();
        sendMessage.setChatId(chatId);
        sendMessage.setText("TO Yarim tayyor mahsulotlar");

        ReplyKeyboardMarkup replyKeyboardMarkup = new ReplyKeyboardMarkup();
        List<KeyboardRow> rowList = new ArrayList<>();

        KeyboardRow row = new KeyboardRow();
        for (int i = 0; i < ppPolufab.length; i++) {
            KeyboardButton button = new KeyboardButton();
            button.setText(ppPolufab[i]);
            row.add(button);

            if (row.size() == 2) {
                rowList.add(row);
                row = new KeyboardRow();
            }
        }
        if (!row.isEmpty()) rowList.add(row);

        replyKeyboardMarkup.setKeyboard(rowList);
        replyKeyboardMarkup.setResizeKeyboard(true);
        sendMessage.setReplyMarkup(replyKeyboardMarkup);
        return sendMessage;
    }

    public SendMessage totortpp(Long chatId) {
        SendMessage sendMessage = new SendMessage();
        sendMessage.setChatId(chatId);
        sendMessage.setText("ПП Торты");

        ReplyKeyboardMarkup replyKeyboardMarkup = new ReplyKeyboardMarkup();
        List<KeyboardRow> rowList = new ArrayList<>();

        KeyboardRow row = new KeyboardRow();
        for (int i = 0; i < ppTort.length; i++) {
            KeyboardButton button = new KeyboardButton();
            button.setText(ppTort[i]);
            row.add(button);

            if (row.size() == 2) {
                rowList.add(row);
                row = new KeyboardRow();
            }
        }
        if (!row.isEmpty()) rowList.add(row);

        replyKeyboardMarkup.setKeyboard(rowList);
        replyKeyboardMarkup.setResizeKeyboard(true);
        sendMessage.setReplyMarkup(replyKeyboardMarkup);
        return sendMessage;
    }

    public SendMessage topishiriq(Long chatId) {
        SendMessage sendMessage = new SendMessage();
        sendMessage.setChatId(chatId);
        sendMessage.setText("ПП Выпечка");

        ReplyKeyboardMarkup replyKeyboardMarkup = new ReplyKeyboardMarkup();
        List<KeyboardRow> rowList = new ArrayList<>();

        KeyboardRow row = new KeyboardRow();
        for (int i = 0; i < topishiriq.length; i++) {
            KeyboardButton button = new KeyboardButton();
            button.setText(topishiriq[i]);
            row.add(button);

            if (row.size() == 2) {
                rowList.add(row);
                row = new KeyboardRow();
            }
        }
        if (!row.isEmpty()) rowList.add(row);

        replyKeyboardMarkup.setKeyboard(rowList);
        replyKeyboardMarkup.setResizeKeyboard(true);
        sendMessage.setReplyMarkup(replyKeyboardMarkup);
        return sendMessage;
    }

    public SendMessage topirojniypp(Long chatId) {
        SendMessage sendMessage = new SendMessage();
        sendMessage.setChatId(chatId);
        sendMessage.setText("ПП Пирожные");

        ReplyKeyboardMarkup replyKeyboardMarkup = new ReplyKeyboardMarkup();
        List<KeyboardRow> rowList = new ArrayList<>();

        KeyboardRow row = new KeyboardRow();
        for (int i = 0; i < ppPiroj.length; i++) {
            KeyboardButton button = new KeyboardButton();
            button.setText(ppPiroj[i]);
            row.add(button);

            if (row.size() == 2) {
                rowList.add(row);
                row = new KeyboardRow();
            }
        }
        if (!row.isEmpty()) rowList.add(row);

        replyKeyboardMarkup.setKeyboard(rowList);
        replyKeyboardMarkup.setResizeKeyboard(true);
        sendMessage.setReplyMarkup(replyKeyboardMarkup);
        return sendMessage;
    }

    public SendMessage yarimtayyor(Long chatId) {
        SendMessage sendMessage = new SendMessage();
        sendMessage.setChatId(chatId);
        sendMessage.setText("Полуфабрикаты");

        ReplyKeyboardMarkup replyKeyboardMarkup = new ReplyKeyboardMarkup();
        List<KeyboardRow> rowList = new ArrayList<>();

        KeyboardRow row = new KeyboardRow();
        for (int i = 0; i < yarimtayyor.length; i++) {
            KeyboardButton button = new KeyboardButton();
            button.setText(yarimtayyor[i]);
            row.add(button);

            if (row.size() == 2) {
                rowList.add(row);
                row = new KeyboardRow();
            }
        }
        if (!row.isEmpty()) rowList.add(row);

        replyKeyboardMarkup.setKeyboard(rowList);
        replyKeyboardMarkup.setResizeKeyboard(true);
        sendMessage.setReplyMarkup(replyKeyboardMarkup);
        return sendMessage;
    }

    public SendMessage non(Long chatId) {
        SendMessage sendMessage = new SendMessage();
        sendMessage.setChatId(chatId);
        sendMessage.setText("Австрийский хлеб");

        ReplyKeyboardMarkup replyKeyboardMarkup = new ReplyKeyboardMarkup();
        List<KeyboardRow> rowList = new ArrayList<>();

        KeyboardRow row = new KeyboardRow();
        for (int i = 0; i < non.length; i++) {
            KeyboardButton button = new KeyboardButton();
            button.setText(non[i]);
            row.add(button);

            if (row.size() == 2) {
                rowList.add(row);
                row = new KeyboardRow();
            }
        }
        if (!row.isEmpty()) rowList.add(row);

        replyKeyboardMarkup.setKeyboard(rowList);
        replyKeyboardMarkup.setResizeKeyboard(true);
        sendMessage.setReplyMarkup(replyKeyboardMarkup);
        return sendMessage;
    }

    public SendMessage barmenyu(Long chatId) {
        SendMessage sendMessage = new SendMessage();
        sendMessage.setChatId(chatId);
        sendMessage.setText("Бар Меню");

        ReplyKeyboardMarkup replyKeyboardMarkup = new ReplyKeyboardMarkup();
        List<KeyboardRow> rowList = new ArrayList<>();

        KeyboardRow row = new KeyboardRow();
        for (int i = 0; i < barmenyu.length; i++) {
            KeyboardButton button = new KeyboardButton();
            button.setText(barmenyu[i]);
            row.add(button);

            if (row.size() == 2) {
                rowList.add(row);
                row = new KeyboardRow();
            }
        }
        if (!row.isEmpty()) rowList.add(row);

        replyKeyboardMarkup.setKeyboard(rowList);
        replyKeyboardMarkup.setResizeKeyboard(true);
        sendMessage.setReplyMarkup(replyKeyboardMarkup);
        return sendMessage;
    }

    public SendMessage sharbat(Long chatId) {
        SendMessage sendMessage = new SendMessage();
        sendMessage.setChatId(chatId);
        sendMessage.setText("Свежевыжатые соки");

        ReplyKeyboardMarkup replyKeyboardMarkup = new ReplyKeyboardMarkup();
        List<KeyboardRow> rowList = new ArrayList<>();

        KeyboardRow row = new KeyboardRow();
        for (int i = 0; i < yangisiqilgan.length; i++) {
            KeyboardButton button = new KeyboardButton();
            button.setText(yangisiqilgan[i]);
            row.add(button);

            if (row.size() == 2) {
                rowList.add(row);
                row = new KeyboardRow();
            }
        }
        if (!row.isEmpty()) rowList.add(row);

        replyKeyboardMarkup.setKeyboard(rowList);
        replyKeyboardMarkup.setResizeKeyboard(true);
        sendMessage.setReplyMarkup(replyKeyboardMarkup);
        return sendMessage;
    }

    public SendMessage milksheyk(Long chatId) {
        SendMessage sendMessage = new SendMessage();
        sendMessage.setChatId(chatId);
        sendMessage.setText("Милкшейки");

        ReplyKeyboardMarkup replyKeyboardMarkup = new ReplyKeyboardMarkup();
        List<KeyboardRow> rowList = new ArrayList<>();

        KeyboardRow row = new KeyboardRow();
        for (int i = 0; i < milksheyk.length; i++) {
            KeyboardButton button = new KeyboardButton();
            button.setText(milksheyk[i]);
            row.add(button);

            if (row.size() == 2) {
                rowList.add(row);
                row = new KeyboardRow();
            }
        }
        if (!row.isEmpty()) rowList.add(row);

        replyKeyboardMarkup.setKeyboard(rowList);
        replyKeyboardMarkup.setResizeKeyboard(true);
        sendMessage.setReplyMarkup(replyKeyboardMarkup);
        return sendMessage;
    }

    public SendMessage limonad(Long chatId) {
        SendMessage sendMessage = new SendMessage();
        sendMessage.setChatId(chatId);
        sendMessage.setText("Лимонады");

        ReplyKeyboardMarkup replyKeyboardMarkup = new ReplyKeyboardMarkup();
        List<KeyboardRow> rowList = new ArrayList<>();

        KeyboardRow row = new KeyboardRow();
        for (int i = 0; i < limonad.length; i++) {
            KeyboardButton button = new KeyboardButton();
            button.setText(limonad[i]);
            row.add(button);

            if (row.size() == 2) {
                rowList.add(row);
                row = new KeyboardRow();
            }
        }
        if (!row.isEmpty()) rowList.add(row);

        replyKeyboardMarkup.setKeyboard(rowList);
        replyKeyboardMarkup.setResizeKeyboard(true);
        sendMessage.setReplyMarkup(replyKeyboardMarkup);
        return sendMessage;
    }

    public SendMessage kofe(Long chatId) {
        SendMessage sendMessage = new SendMessage();
        sendMessage.setChatId(chatId);
        sendMessage.setText("Кофе");

        ReplyKeyboardMarkup replyKeyboardMarkup = new ReplyKeyboardMarkup();
        List<KeyboardRow> rowList = new ArrayList<>();

        KeyboardRow row = new KeyboardRow();
        for (int i = 0; i < kofe.length; i++) {
            KeyboardButton button = new KeyboardButton();
            button.setText(kofe[i]);
            row.add(button);

            if (row.size() == 2) {
                rowList.add(row);
                row = new KeyboardRow();
            }
        }
        if (!row.isEmpty()) rowList.add(row);

        replyKeyboardMarkup.setKeyboard(rowList);
        replyKeyboardMarkup.setResizeKeyboard(true);
        sendMessage.setReplyMarkup(replyKeyboardMarkup);
        return sendMessage;
    }

    public SendMessage qahva(Long chatId) {
        SendMessage sendMessage = new SendMessage();
        sendMessage.setChatId(chatId);
        sendMessage.setText("Абонементы на кофе");

        ReplyKeyboardMarkup replyKeyboardMarkup = new ReplyKeyboardMarkup();
        List<KeyboardRow> rowList = new ArrayList<>();

        KeyboardRow row = new KeyboardRow();
        for (int i = 0; i < qahva.length; i++) {
            KeyboardButton button = new KeyboardButton();
            button.setText(qahva[i]);
            row.add(button);

            if (row.size() == 2) {
                rowList.add(row);
                row = new KeyboardRow();
            }
        }
        if (!row.isEmpty()) rowList.add(row);

        replyKeyboardMarkup.setKeyboard(rowList);
        replyKeyboardMarkup.setResizeKeyboard(true);
        sendMessage.setReplyMarkup(replyKeyboardMarkup);
        return sendMessage;
    }

    public SendPhoto tovar(Long chatId, String photo, String caption, String price) {
        SendPhoto sendPhoto = new SendPhoto();
        sendPhoto.setChatId(chatId);
        sendPhoto.setPhoto(new InputFile(photo));
        sendPhoto.setCaption(caption + "\n\nЦена: " + price + " сум");

        ReplyKeyboardMarkup replyKeyboardMarkup = new ReplyKeyboardMarkup();
        List<KeyboardRow> rowList = new ArrayList<>();

        KeyboardRow row = new KeyboardRow();
        for (int i = 1; i < 10; i++) {
            KeyboardButton button = new KeyboardButton();
            button.setText(String.valueOf(i) + " шт");
            row.add(button);

            if (row.size() == 3) {
                rowList.add(row);
                row = new KeyboardRow();
            }
        }

        KeyboardRow row1 = new KeyboardRow();
        KeyboardButton back = new KeyboardButton();
        back.setText("⬅\uFE0F В главное меню");
        row1.add(back);
        rowList.add(row1);

        KeyboardButton cart = new KeyboardButton();
        cart.setText("\uD83D\uDED2 Корзина");
        row1.add(cart);

        replyKeyboardMarkup.setKeyboard(rowList);
        replyKeyboardMarkup.setResizeKeyboard(true);
        sendPhoto.setReplyMarkup(replyKeyboardMarkup);
        return sendPhoto;
    }

    public SendPhoto animatorbn(Long chatId) {
        SendPhoto sendPhoto = new SendPhoto();
        sendPhoto.setChatId(chatId);
        sendPhoto.setPhoto(new InputFile("https://t.me/safiapictures/13"));
        sendPhoto.setCaption("Доставка с аниматором\n\n" + "Представьте, что этот герой мультфильма доставит вам торт! ?⭐\n\n" + "Для любого детского праздника, особенно дня рождения ребенка, важно создать волшебный и незабываемый момент. Мы предлагаем сделать праздник вашего ребенка магическим и незабываемым.\n\n" + "Аниматор вручает торт под традиционную песню, что может быть ещё волшебнее?\n\n" + "Цена: 180 000 сум");

        ReplyKeyboardMarkup replyKeyboardMarkup = new ReplyKeyboardMarkup();
        List<KeyboardRow> rowList = new ArrayList<>();

        KeyboardRow row = new KeyboardRow();
        KeyboardButton addCart = new KeyboardButton();
        addCart.setText("\uD83D\uDED2 Добавить в корзину");
        row.add(addCart);
        rowList.add(row);

        KeyboardRow row1 = new KeyboardRow();
        KeyboardButton back = new KeyboardButton();
        back.setText("⬅\uFE0F В главное меню");
        row1.add(back);
        rowList.add(row1);

        KeyboardButton cart = new KeyboardButton();
        cart.setText("\uD83D\uDED2 Корзина");
        row1.add(cart);

        replyKeyboardMarkup.setKeyboard(rowList);
        replyKeyboardMarkup.setResizeKeyboard(true);
        sendPhoto.setReplyMarkup(replyKeyboardMarkup);
        return sendPhoto;
    }

    public SendMessage savat(Long chatId) {
        SendMessage sendMessage = new SendMessage();
        sendMessage.setChatId(chatId);
        sendMessage.setText("\uD83D\uDECD Ваш заказ принимается...");
        return sendMessage;
    }

    public SendMessage tasdiqlash(Long chatId) {
        SendMessage sendMessage = new SendMessage();
        sendMessage.setChatId(chatId);
        sendMessage.setText("Вы подтверждаете добавление в корзину?");

        InlineKeyboardMarkup inlineKeyboardMarkup = new InlineKeyboardMarkup();
        List<List<InlineKeyboardButton>> rowList = new ArrayList<>();

        List<InlineKeyboardButton> row = new ArrayList<>();
        InlineKeyboardButton buttonYes = new InlineKeyboardButton();
        buttonYes.setText("Да ✅");
        buttonYes.setCallbackData("yesruId");
        row.add(buttonYes);
        rowList.add(row);

        InlineKeyboardButton buttonNo = new InlineKeyboardButton();
        buttonNo.setText("Нет ❌");
        buttonNo.setCallbackData("noruId");
        row.add(buttonNo);

        inlineKeyboardMarkup.setKeyboard(rowList);
        sendMessage.setReplyMarkup(inlineKeyboardMarkup);
        return sendMessage;
    }

    public SendMessage yes(Long chatId) {
        SendMessage sendMessage = new SendMessage();
        sendMessage.setChatId(chatId);
        sendMessage.setText("Добавлено в корзину ✅");
        return sendMessage;
    }

    public SendMessage no(Long chatId) {
        SendMessage sendMessage = new SendMessage();
        sendMessage.setChatId(chatId);
        sendMessage.setText("Продолжайте покупки \uD83D\uDECD");
        return sendMessage;
    }

}
